espressif/esp-idf/components/soc/esp32s31/register/soc/hp_system_reg.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** HP_SYSTEM_VER_DATE_REG register
 *  NA
 */
#define HP_SYSTEM_VER_DATE_REG (DR_REG_HP_SYS_BASE + 0x0)
/** HP_SYSTEM_REG_VER_DATE : R/W; bitpos: [31:0]; default: 539296770;
 *  NA
 */
#define HP_SYSTEM_REG_VER_DATE    0xFFFFFFFFU
#define HP_SYSTEM_REG_VER_DATE_M  (HP_SYSTEM_REG_VER_DATE_V << HP_SYSTEM_REG_VER_DATE_S)
#define HP_SYSTEM_REG_VER_DATE_V  0xFFFFFFFFU
#define HP_SYSTEM_REG_VER_DATE_S  0

/** HP_SYSTEM_CLK_EN_REG register
 *  NA
 */
#define HP_SYSTEM_CLK_EN_REG (DR_REG_HP_SYS_BASE + 0x4)
/** HP_SYSTEM_REG_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  NA
 */
#define HP_SYSTEM_REG_CLK_EN    (BIT(0))
#define HP_SYSTEM_REG_CLK_EN_M  (HP_SYSTEM_REG_CLK_EN_V << HP_SYSTEM_REG_CLK_EN_S)
#define HP_SYSTEM_REG_CLK_EN_V  0x00000001U
#define HP_SYSTEM_REG_CLK_EN_S  0

/** HP_SYSTEM_CPU_INT_FROM_CPU_0_REG register
 *  NA
 */
#define HP_SYSTEM_CPU_INT_FROM_CPU_0_REG (DR_REG_HP_SYS_BASE + 0x10)
/** HP_SYSTEM_CPU_INT_FROM_CPU_0 : R/W; bitpos: [0]; default: 0;
 *  set 1 will trigger a interrupt
 */
#define HP_SYSTEM_CPU_INT_FROM_CPU_0    (BIT(0))
#define HP_SYSTEM_CPU_INT_FROM_CPU_0_M  (HP_SYSTEM_CPU_INT_FROM_CPU_0_V << HP_SYSTEM_CPU_INT_FROM_CPU_0_S)
#define HP_SYSTEM_CPU_INT_FROM_CPU_0_V  0x00000001U
#define HP_SYSTEM_CPU_INT_FROM_CPU_0_S  0

/** HP_SYSTEM_CPU_INT_FROM_CPU_1_REG register
 *  NA
 */
#define HP_SYSTEM_CPU_INT_FROM_CPU_1_REG (DR_REG_HP_SYS_BASE + 0x14)
/** HP_SYSTEM_CPU_INT_FROM_CPU_1 : R/W; bitpos: [0]; default: 0;
 *  set 1 will trigger a interrupt
 */
#define HP_SYSTEM_CPU_INT_FROM_CPU_1    (BIT(0))
#define HP_SYSTEM_CPU_INT_FROM_CPU_1_M  (HP_SYSTEM_CPU_INT_FROM_CPU_1_V << HP_SYSTEM_CPU_INT_FROM_CPU_1_S)
#define HP_SYSTEM_CPU_INT_FROM_CPU_1_V  0x00000001U
#define HP_SYSTEM_CPU_INT_FROM_CPU_1_S  0

/** HP_SYSTEM_CPU_INT_FROM_CPU_2_REG register
 *  NA
 */
#define HP_SYSTEM_CPU_INT_FROM_CPU_2_REG (DR_REG_HP_SYS_BASE + 0x18)
/** HP_SYSTEM_CPU_INT_FROM_CPU_2 : R/W; bitpos: [0]; default: 0;
 *  set 1 will trigger a interrupt
 */
#define HP_SYSTEM_CPU_INT_FROM_CPU_2    (BIT(0))
#define HP_SYSTEM_CPU_INT_FROM_CPU_2_M  (HP_SYSTEM_CPU_INT_FROM_CPU_2_V << HP_SYSTEM_CPU_INT_FROM_CPU_2_S)
#define HP_SYSTEM_CPU_INT_FROM_CPU_2_V  0x00000001U
#define HP_SYSTEM_CPU_INT_FROM_CPU_2_S  0

/** HP_SYSTEM_CPU_INT_FROM_CPU_3_REG register
 *  NA
 */
#define HP_SYSTEM_CPU_INT_FROM_CPU_3_REG (DR_REG_HP_SYS_BASE + 0x1c)
/** HP_SYSTEM_CPU_INT_FROM_CPU_3 : R/W; bitpos: [0]; default: 0;
 *  set 1 will trigger a interrupt
 */
#define HP_SYSTEM_CPU_INT_FROM_CPU_3    (BIT(0))
#define HP_SYSTEM_CPU_INT_FROM_CPU_3_M  (HP_SYSTEM_CPU_INT_FROM_CPU_3_V << HP_SYSTEM_CPU_INT_FROM_CPU_3_S)
#define HP_SYSTEM_CPU_INT_FROM_CPU_3_V  0x00000001U
#define HP_SYSTEM_CPU_INT_FROM_CPU_3_S  0

/** HP_SYSTEM_MODEM_DIAG_EN_REG register
 *  NA
 */
#define HP_SYSTEM_MODEM_DIAG_EN_REG (DR_REG_HP_SYS_BASE + 0x28)
/** HP_SYSTEM_REG_MODEM_DIAG_EN : R/W; bitpos: [31:0]; default: 0;
 *  set reg_modem_diag_en[15:0] will let hp_probe_out[15:0] used as modem_diag[15:0],
 *  set reg_modem_diag_en[31:16] will let lcd_data_out[15:0] used as modem_diag[31:16]
 */
#define HP_SYSTEM_REG_MODEM_DIAG_EN    0xFFFFFFFFU
#define HP_SYSTEM_REG_MODEM_DIAG_EN_M  (HP_SYSTEM_REG_MODEM_DIAG_EN_V << HP_SYSTEM_REG_MODEM_DIAG_EN_S)
#define HP_SYSTEM_REG_MODEM_DIAG_EN_V  0xFFFFFFFFU
#define HP_SYSTEM_REG_MODEM_DIAG_EN_S  0

/** HP_SYSTEM_TCM_RAM_PWR_CTRL0_REG register
 *  NA
 */
#define HP_SYSTEM_TCM_RAM_PWR_CTRL0_REG (DR_REG_HP_SYS_BASE + 0x3c)
/** HP_SYSTEM_REG_HP_SYSTEM_TCM_CLK_FORCE_ON : R/W; bitpos: [0]; default: 0;
 *  hp_tcm clk gatig force on
 */
#define HP_SYSTEM_REG_HP_SYSTEM_TCM_CLK_FORCE_ON    (BIT(0))
#define HP_SYSTEM_REG_HP_SYSTEM_TCM_CLK_FORCE_ON_M  (HP_SYSTEM_REG_HP_SYSTEM_TCM_CLK_FORCE_ON_V << HP_SYSTEM_REG_HP_SYSTEM_TCM_CLK_FORCE_ON_S)
#define HP_SYSTEM_REG_HP_SYSTEM_TCM_CLK_FORCE_ON_V  0x00000001U
#define HP_SYSTEM_REG_HP_SYSTEM_TCM_CLK_FORCE_ON_S  0

/** HP_SYSTEM_ROM_PWR_CTRL0_REG register
 *  NA
 */
#define HP_SYSTEM_ROM_PWR_CTRL0_REG (DR_REG_HP_SYS_BASE + 0x40)
/** HP_SYSTEM_REG_HP_SYSTEM_ROM_CLK_FORCE_ON : R/W; bitpos: [0]; default: 0;
 *  hp_rom clk gating force on
 */
#define HP_SYSTEM_REG_HP_SYSTEM_ROM_CLK_FORCE_ON    (BIT(0))
#define HP_SYSTEM_REG_HP_SYSTEM_ROM_CLK_FORCE_ON_M  (HP_SYSTEM_REG_HP_SYSTEM_ROM_CLK_FORCE_ON_V << HP_SYSTEM_REG_HP_SYSTEM_ROM_CLK_FORCE_ON_S)
#define HP_SYSTEM_REG_HP_SYSTEM_ROM_CLK_FORCE_ON_V  0x00000001U
#define HP_SYSTEM_REG_HP_SYSTEM_ROM_CLK_FORCE_ON_S  0

/** HP_SYSTEM_PROBEA_CTRL_REG register
 *  NA
 */
#define HP_SYSTEM_PROBEA_CTRL_REG (DR_REG_HP_SYS_BASE + 0x50)
/** HP_SYSTEM_REG_PROBE_A_MOD_SEL : R/W; bitpos: [15:0]; default: 0;
 *  This field is used to selec probe_group from probe_group0 to probe_group15 for
 *  module's probe_out[31:0] in a mode
 */
#define HP_SYSTEM_REG_PROBE_A_MOD_SEL    0x0000FFFFU
#define HP_SYSTEM_REG_PROBE_A_MOD_SEL_M  (HP_SYSTEM_REG_PROBE_A_MOD_SEL_V << HP_SYSTEM_REG_PROBE_A_MOD_SEL_S)
#define HP_SYSTEM_REG_PROBE_A_MOD_SEL_V  0x0000FFFFU
#define HP_SYSTEM_REG_PROBE_A_MOD_SEL_S  0
/** HP_SYSTEM_REG_PROBE_A_TOP_SEL : R/W; bitpos: [23:16]; default: 0;
 *  This field is used to selec module's probe_out[31:0] as probe out in a mode
 */
#define HP_SYSTEM_REG_PROBE_A_TOP_SEL    0x000000FFU
#define HP_SYSTEM_REG_PROBE_A_TOP_SEL_M  (HP_SYSTEM_REG_PROBE_A_TOP_SEL_V << HP_SYSTEM_REG_PROBE_A_TOP_SEL_S)
#define HP_SYSTEM_REG_PROBE_A_TOP_SEL_V  0x000000FFU
#define HP_SYSTEM_REG_PROBE_A_TOP_SEL_S  16
/** HP_SYSTEM_REG_PROBE_L_SEL : R/W; bitpos: [25:24]; default: 0;
 *  This field is used to selec probe_out[31:16]
 */
#define HP_SYSTEM_REG_PROBE_L_SEL    0x00000003U
#define HP_SYSTEM_REG_PROBE_L_SEL_M  (HP_SYSTEM_REG_PROBE_L_SEL_V << HP_SYSTEM_REG_PROBE_L_SEL_S)
#define HP_SYSTEM_REG_PROBE_L_SEL_V  0x00000003U
#define HP_SYSTEM_REG_PROBE_L_SEL_S  24
/** HP_SYSTEM_REG_PROBE_H_SEL : R/W; bitpos: [27:26]; default: 0;
 *  This field is used to selec probe_out[31:16]
 */
#define HP_SYSTEM_REG_PROBE_H_SEL    0x00000003U
#define HP_SYSTEM_REG_PROBE_H_SEL_M  (HP_SYSTEM_REG_PROBE_H_SEL_V << HP_SYSTEM_REG_PROBE_H_SEL_S)
#define HP_SYSTEM_REG_PROBE_H_SEL_V  0x00000003U
#define HP_SYSTEM_REG_PROBE_H_SEL_S  26
/** HP_SYSTEM_REG_PROBE_GLOBAL_EN : R/W; bitpos: [28]; default: 0;
 *  Set this bit to enable global debug probe in hp system.
 */
#define HP_SYSTEM_REG_PROBE_GLOBAL_EN    (BIT(28))
#define HP_SYSTEM_REG_PROBE_GLOBAL_EN_M  (HP_SYSTEM_REG_PROBE_GLOBAL_EN_V << HP_SYSTEM_REG_PROBE_GLOBAL_EN_S)
#define HP_SYSTEM_REG_PROBE_GLOBAL_EN_V  0x00000001U
#define HP_SYSTEM_REG_PROBE_GLOBAL_EN_S  28

/** HP_SYSTEM_PROBEB_CTRL_REG register
 *  NA
 */
#define HP_SYSTEM_PROBEB_CTRL_REG (DR_REG_HP_SYS_BASE + 0x54)
/** HP_SYSTEM_REG_PROBE_B_MOD_SEL : R/W; bitpos: [15:0]; default: 0;
 *  This field is used to selec probe_group from probe_group0 to probe_group15 for
 *  module's probe_out[31:0] in b mode.
 */
#define HP_SYSTEM_REG_PROBE_B_MOD_SEL    0x0000FFFFU
#define HP_SYSTEM_REG_PROBE_B_MOD_SEL_M  (HP_SYSTEM_REG_PROBE_B_MOD_SEL_V << HP_SYSTEM_REG_PROBE_B_MOD_SEL_S)
#define HP_SYSTEM_REG_PROBE_B_MOD_SEL_V  0x0000FFFFU
#define HP_SYSTEM_REG_PROBE_B_MOD_SEL_S  0
/** HP_SYSTEM_REG_PROBE_B_TOP_SEL : R/W; bitpos: [23:16]; default: 0;
 *  This field is used to select module's probe_out[31:0]  as probe_out in b mode
 */
#define HP_SYSTEM_REG_PROBE_B_TOP_SEL    0x000000FFU
#define HP_SYSTEM_REG_PROBE_B_TOP_SEL_M  (HP_SYSTEM_REG_PROBE_B_TOP_SEL_V << HP_SYSTEM_REG_PROBE_B_TOP_SEL_S)
#define HP_SYSTEM_REG_PROBE_B_TOP_SEL_V  0x000000FFU
#define HP_SYSTEM_REG_PROBE_B_TOP_SEL_S  16
/** HP_SYSTEM_REG_PROBE_B_EN : R/W; bitpos: [24]; default: 0;
 *  Set this bit to enable b mode for debug probe. 1:  b mode, 0: a mode.
 */
#define HP_SYSTEM_REG_PROBE_B_EN    (BIT(24))
#define HP_SYSTEM_REG_PROBE_B_EN_M  (HP_SYSTEM_REG_PROBE_B_EN_V << HP_SYSTEM_REG_PROBE_B_EN_S)
#define HP_SYSTEM_REG_PROBE_B_EN_V  0x00000001U
#define HP_SYSTEM_REG_PROBE_B_EN_S  24

