espressif/esp-idf/components/soc/esp32s31/register/soc/hp_system_reg.h
/** HP_SYSTEM_CACHE_PWR_CTRL_REG register
 *  NA
 */
#define HP_SYSTEM_CACHE_PWR_CTRL_REG (DR_REG_HP_SYS_BASE + 0x110)
/** HP_SYSTEM_REG_AC_MEM_FO : R/W; bitpos: [7:0]; default: 0;
 *  need_des
 */
#define HP_SYSTEM_REG_AC_MEM_FO    0x000000FFU
#define HP_SYSTEM_REG_AC_MEM_FO_M  (HP_SYSTEM_REG_AC_MEM_FO_V << HP_SYSTEM_REG_AC_MEM_FO_S)
#define HP_SYSTEM_REG_AC_MEM_FO_V  0x000000FFU
#define HP_SYSTEM_REG_AC_MEM_FO_S  0
/** HP_SYSTEM_REG_IC_MEM_FO : R/W; bitpos: [15:8]; default: 0;
 *  need_des
 */
#define HP_SYSTEM_REG_IC_MEM_FO    0x000000FFU
#define HP_SYSTEM_REG_IC_MEM_FO_M  (HP_SYSTEM_REG_IC_MEM_FO_V << HP_SYSTEM_REG_IC_MEM_FO_S)
#define HP_SYSTEM_REG_IC_MEM_FO_V  0x000000FFU
#define HP_SYSTEM_REG_IC_MEM_FO_S  8
/** HP_SYSTEM_REG_DC_MEM_FO : R/W; bitpos: [23:16]; default: 0;
 *  need_des
 */
#define HP_SYSTEM_REG_DC_MEM_FO    0x000000FFU
#define HP_SYSTEM_REG_DC_MEM_FO_M  (HP_SYSTEM_REG_DC_MEM_FO_V << HP_SYSTEM_REG_DC_MEM_FO_S)
#define HP_SYSTEM_REG_DC_MEM_FO_V  0x000000FFU
#define HP_SYSTEM_REG_DC_MEM_FO_S  16

/** HP_SYSTEM_TCM_DATA_DUMP_CTRL_REG register
 *  need_des
 */
#define HP_SYSTEM_TCM_DATA_DUMP_CTRL_REG (DR_REG_HP_SYS_BASE + 0x114)
/** HP_SYSTEM_TCM_DATA_DUMP_EN : R/W; bitpos: [31:0]; default: 0;
 *  hp tcm_data dump switch
 */
#define HP_SYSTEM_TCM_DATA_DUMP_EN    0xFFFFFFFFU
#define HP_SYSTEM_TCM_DATA_DUMP_EN_M  (HP_SYSTEM_TCM_DATA_DUMP_EN_V << HP_SYSTEM_TCM_DATA_DUMP_EN_S)
#define HP_SYSTEM_TCM_DATA_DUMP_EN_V  0xFFFFFFFFU
#define HP_SYSTEM_TCM_DATA_DUMP_EN_S  0

/** HP_SYSTEM_CPU_WAITI_CONF_REG register
 *  CPU_WAITI configuration register
 */
#define HP_SYSTEM_CPU_WAITI_CONF_REG (DR_REG_HP_SYS_BASE + 0x118)
/** HP_SYSTEM_CPU_WAIT_MODE_FORCE_ON : R/W; bitpos: [0]; default: 1;
 *  Set 1 to force cpu_waiti_clk enable.
 */
#define HP_SYSTEM_CPU_WAIT_MODE_FORCE_ON    (BIT(0))
#define HP_SYSTEM_CPU_WAIT_MODE_FORCE_ON_M  (HP_SYSTEM_CPU_WAIT_MODE_FORCE_ON_V << HP_SYSTEM_CPU_WAIT_MODE_FORCE_ON_S)
#define HP_SYSTEM_CPU_WAIT_MODE_FORCE_ON_V  0x00000001U
#define HP_SYSTEM_CPU_WAIT_MODE_FORCE_ON_S  0
/** HP_SYSTEM_CPU_WAITI_DELAY_NUM : R/W; bitpos: [4:1]; default: 0;
 *  This field used to set delay cycle when cpu enter waiti mode, after delay waiti_clk
 *  will close
 */
#define HP_SYSTEM_CPU_WAITI_DELAY_NUM    0x0000000FU
#define HP_SYSTEM_CPU_WAITI_DELAY_NUM_M  (HP_SYSTEM_CPU_WAITI_DELAY_NUM_V << HP_SYSTEM_CPU_WAITI_DELAY_NUM_S)
#define HP_SYSTEM_CPU_WAITI_DELAY_NUM_V  0x0000000FU
#define HP_SYSTEM_CPU_WAITI_DELAY_NUM_S  1

/** HP_SYSTEM_CORE_DEBUG_RUNSTALL_CONF_REG register
 *  Core Debug runstall configure register
 */
#define HP_SYSTEM_CORE_DEBUG_RUNSTALL_CONF_REG (DR_REG_HP_SYS_BASE + 0x11c)
/** HP_SYSTEM_CORE_DEBUG_RUNSTALL_ENABLE : R/W; bitpos: [0]; default: 0;
 *  Set this field to 1 to enable debug runstall feature between HP-core and LP-core.
 */
#define HP_SYSTEM_CORE_DEBUG_RUNSTALL_ENABLE    (BIT(0))
#define HP_SYSTEM_CORE_DEBUG_RUNSTALL_ENABLE_M  (HP_SYSTEM_CORE_DEBUG_RUNSTALL_ENABLE_V << HP_SYSTEM_CORE_DEBUG_RUNSTALL_ENABLE_S)
#define HP_SYSTEM_CORE_DEBUG_RUNSTALL_ENABLE_V  0x00000001U
#define HP_SYSTEM_CORE_DEBUG_RUNSTALL_ENABLE_S  0

/** HP_SYSTEM_CORE_IBUS_TIMEOUT_CONF_REG register
 *  need_des
 */
#define HP_SYSTEM_CORE_IBUS_TIMEOUT_CONF_REG (DR_REG_HP_SYS_BASE + 0x124)
/** HP_SYSTEM_CORE_IBUS_TIMEOUT_PROTECT_EN : R/W; bitpos: [0]; default: 1;
 *  set this field to 1 to enable hp core0&1 ibus timeout handle
 */
#define HP_SYSTEM_CORE_IBUS_TIMEOUT_PROTECT_EN    (BIT(0))
#define HP_SYSTEM_CORE_IBUS_TIMEOUT_PROTECT_EN_M  (HP_SYSTEM_CORE_IBUS_TIMEOUT_PROTECT_EN_V << HP_SYSTEM_CORE_IBUS_TIMEOUT_PROTECT_EN_S)
#define HP_SYSTEM_CORE_IBUS_TIMEOUT_PROTECT_EN_V  0x00000001U
#define HP_SYSTEM_CORE_IBUS_TIMEOUT_PROTECT_EN_S  0
/** HP_SYSTEM_CORE_IBUS_TIMEOUT_THRES : R/W; bitpos: [16:1]; default: 65535;
 *  This field used to set hp core0&1 ibus timeout  threshold
 */
#define HP_SYSTEM_CORE_IBUS_TIMEOUT_THRES    0x0000FFFFU
#define HP_SYSTEM_CORE_IBUS_TIMEOUT_THRES_M  (HP_SYSTEM_CORE_IBUS_TIMEOUT_THRES_V << HP_SYSTEM_CORE_IBUS_TIMEOUT_THRES_S)
#define HP_SYSTEM_CORE_IBUS_TIMEOUT_THRES_V  0x0000FFFFU
#define HP_SYSTEM_CORE_IBUS_TIMEOUT_THRES_S  1

/** HP_SYSTEM_CORE_DBUS_TIMEOUT_CONF_REG register
 *  need_des
 */
#define HP_SYSTEM_CORE_DBUS_TIMEOUT_CONF_REG (DR_REG_HP_SYS_BASE + 0x128)
/** HP_SYSTEM_CORE_DBUS_TIMEOUT_PROTECT_EN : R/W; bitpos: [0]; default: 1;
 *  set this field to 1 to enable hp core0&1 dbus timeout handle
 */
#define HP_SYSTEM_CORE_DBUS_TIMEOUT_PROTECT_EN    (BIT(0))
#define HP_SYSTEM_CORE_DBUS_TIMEOUT_PROTECT_EN_M  (HP_SYSTEM_CORE_DBUS_TIMEOUT_PROTECT_EN_V << HP_SYSTEM_CORE_DBUS_TIMEOUT_PROTECT_EN_S)
#define HP_SYSTEM_CORE_DBUS_TIMEOUT_PROTECT_EN_V  0x00000001U
#define HP_SYSTEM_CORE_DBUS_TIMEOUT_PROTECT_EN_S  0
/** HP_SYSTEM_CORE_DBUS_TIMEOUT_THRES : R/W; bitpos: [16:1]; default: 65535;
 *  This field used to set hp core0&1 dbus timeout  threshold
 */
#define HP_SYSTEM_CORE_DBUS_TIMEOUT_THRES    0x0000FFFFU
#define HP_SYSTEM_CORE_DBUS_TIMEOUT_THRES_M  (HP_SYSTEM_CORE_DBUS_TIMEOUT_THRES_V << HP_SYSTEM_CORE_DBUS_TIMEOUT_THRES_S)
#define HP_SYSTEM_CORE_DBUS_TIMEOUT_THRES_V  0x0000FFFFU
#define HP_SYSTEM_CORE_DBUS_TIMEOUT_THRES_S  1

/** HP_SYSTEM_ICM_H2X_CFG_REG register
 *  need_des
 */
#define HP_SYSTEM_ICM_H2X_CFG_REG (DR_REG_HP_SYS_BASE + 0x138)
/** HP_SYSTEM_CPU_ICM_H2X_POST_WR_EN : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define HP_SYSTEM_CPU_ICM_H2X_POST_WR_EN    (BIT(0))
#define HP_SYSTEM_CPU_ICM_H2X_POST_WR_EN_M  (HP_SYSTEM_CPU_ICM_H2X_POST_WR_EN_V << HP_SYSTEM_CPU_ICM_H2X_POST_WR_EN_S)
#define HP_SYSTEM_CPU_ICM_H2X_POST_WR_EN_V  0x00000001U
#define HP_SYSTEM_CPU_ICM_H2X_POST_WR_EN_S  0
/** HP_SYSTEM_CPU_ICM_H2X_CUT_THROUGH_EN : R/W; bitpos: [1]; default: 1;
 *  need_des
 */
#define HP_SYSTEM_CPU_ICM_H2X_CUT_THROUGH_EN    (BIT(1))
#define HP_SYSTEM_CPU_ICM_H2X_CUT_THROUGH_EN_M  (HP_SYSTEM_CPU_ICM_H2X_CUT_THROUGH_EN_V << HP_SYSTEM_CPU_ICM_H2X_CUT_THROUGH_EN_S)
#define HP_SYSTEM_CPU_ICM_H2X_CUT_THROUGH_EN_V  0x00000001U
#define HP_SYSTEM_CPU_ICM_H2X_CUT_THROUGH_EN_S  1
/** HP_SYSTEM_CPU_ICM_H2X_BRIDGE_BUSY : RO; bitpos: [2]; default: 0;
 *  need_des
 */
#define HP_SYSTEM_CPU_ICM_H2X_BRIDGE_BUSY    (BIT(2))
#define HP_SYSTEM_CPU_ICM_H2X_BRIDGE_BUSY_M  (HP_SYSTEM_CPU_ICM_H2X_BRIDGE_BUSY_V << HP_SYSTEM_CPU_ICM_H2X_BRIDGE_BUSY_S)
#define HP_SYSTEM_CPU_ICM_H2X_BRIDGE_BUSY_V  0x00000001U
#define HP_SYSTEM_CPU_ICM_H2X_BRIDGE_BUSY_S  2
/** HP_SYSTEM_SDMMC_ICM_H2X_POST_WR_EN : R/W; bitpos: [3]; default: 0;
 *  need_des
 */
#define HP_SYSTEM_SDMMC_ICM_H2X_POST_WR_EN    (BIT(3))
#define HP_SYSTEM_SDMMC_ICM_H2X_POST_WR_EN_M  (HP_SYSTEM_SDMMC_ICM_H2X_POST_WR_EN_V << HP_SYSTEM_SDMMC_ICM_H2X_POST_WR_EN_S)
#define HP_SYSTEM_SDMMC_ICM_H2X_POST_WR_EN_V  0x00000001U
#define HP_SYSTEM_SDMMC_ICM_H2X_POST_WR_EN_S  3
/** HP_SYSTEM_SDMMC_ICM_H2X_CUT_THROUGH_EN : R/W; bitpos: [4]; default: 1;
 *  need_des
 */
#define HP_SYSTEM_SDMMC_ICM_H2X_CUT_THROUGH_EN    (BIT(4))
#define HP_SYSTEM_SDMMC_ICM_H2X_CUT_THROUGH_EN_M  (HP_SYSTEM_SDMMC_ICM_H2X_CUT_THROUGH_EN_V << HP_SYSTEM_SDMMC_ICM_H2X_CUT_THROUGH_EN_S)
#define HP_SYSTEM_SDMMC_ICM_H2X_CUT_THROUGH_EN_V  0x00000001U
#define HP_SYSTEM_SDMMC_ICM_H2X_CUT_THROUGH_EN_S  4
/** HP_SYSTEM_SDMMC_ICM_H2X_BRIDGE_BUSY : RO; bitpos: [5]; default: 0;
 *  need_des
 */
#define HP_SYSTEM_SDMMC_ICM_H2X_BRIDGE_BUSY    (BIT(5))
#define HP_SYSTEM_SDMMC_ICM_H2X_BRIDGE_BUSY_M  (HP_SYSTEM_SDMMC_ICM_H2X_BRIDGE_BUSY_V << HP_SYSTEM_SDMMC_ICM_H2X_BRIDGE_BUSY_S)
#define HP_SYSTEM_SDMMC_ICM_H2X_BRIDGE_BUSY_V  0x00000001U
#define HP_SYSTEM_SDMMC_ICM_H2X_BRIDGE_BUSY_S  5

/** HP_SYSTEM_BITSCRAMBLER_PERI_SEL_REG register
 *  Bitscrambler Peri Sel
 */
#define HP_SYSTEM_BITSCRAMBLER_PERI_SEL_REG (DR_REG_HP_SYS_BASE + 0x140)
/** HP_SYSTEM_BITSCRAMBLER_PERI_RX_SEL : R/W; bitpos: [4:0]; default: 0;
 *  Set  this field to sel peri with DMA RX interface to connect with bitscrambler:
 *  lcd_cam: 5'h1, gpspi2: 5'h2: gpspi3: 5'h3, parl_io:5'h4, aes: 5'h5, sha: 5'h6, adc:
 *  5'h7, i2s0_ch0: 5'h8, i2s0_ch1: 5'h9, i2s0_ch2: 5'ha, i2s0_ch3: 5'hb,
 *  i2s1_ch0: 5'hc, i2s1_ch1: 5'hd, i2s1_ch2: 5'he, i2s1_ch3: 5'hf, uhci0: 5'h10, RMT:
 *  5'h11, none: else.
 */
#define HP_SYSTEM_BITSCRAMBLER_PERI_RX_SEL    0x0000001FU
#define HP_SYSTEM_BITSCRAMBLER_PERI_RX_SEL_M  (HP_SYSTEM_BITSCRAMBLER_PERI_RX_SEL_V << HP_SYSTEM_BITSCRAMBLER_PERI_RX_SEL_S)
#define HP_SYSTEM_BITSCRAMBLER_PERI_RX_SEL_V  0x0000001FU
#define HP_SYSTEM_BITSCRAMBLER_PERI_RX_SEL_S  0
/** HP_SYSTEM_BITSCRAMBLER_PERI_TX_SEL : R/W; bitpos: [9:5]; default: 0;
 *  Set  this field to sel peri with DMA TX interface to connect with bitscrambler:
 *  lcd_cam: 5'h1, gpspi2: 5'h2: gpspi3: 5'h3, parl_io:5'h4, aes: 5'h5, sha: 5'h6, adc:
 *  5'h7, i2s0_ch0: 5'h8, i2s0_ch1: 5'h9, i2s0_ch2: 5'ha, i2s0_ch3: 5'hb,
 *  i2s1_ch0: 5'hc, i2s1_ch1: 5'hd, i2s1_ch2: 5'he, i2s1_ch3: 5'hf, uhci0: 5'h10, RMT:
 *  5'h11, none: else.
 */
#define HP_SYSTEM_BITSCRAMBLER_PERI_TX_SEL    0x0000001FU
#define HP_SYSTEM_BITSCRAMBLER_PERI_TX_SEL_M  (HP_SYSTEM_BITSCRAMBLER_PERI_TX_SEL_V << HP_SYSTEM_BITSCRAMBLER_PERI_TX_SEL_S)
#define HP_SYSTEM_BITSCRAMBLER_PERI_TX_SEL_V  0x0000001FU
#define HP_SYSTEM_BITSCRAMBLER_PERI_TX_SEL_S  5

/** HP_SYSTEM_GDMA_CTRL_REG register
 *  N/A
 */
#define HP_SYSTEM_GDMA_CTRL_REG (DR_REG_HP_SYS_BASE + 0x148)
/** HP_SYSTEM_DEBUG_CH_NUM : R/W; bitpos: [1:0]; default: 0;
 *  N/A
 */
#define HP_SYSTEM_DEBUG_CH_NUM    0x00000003U
#define HP_SYSTEM_DEBUG_CH_NUM_M  (HP_SYSTEM_DEBUG_CH_NUM_V << HP_SYSTEM_DEBUG_CH_NUM_S)
#define HP_SYSTEM_DEBUG_CH_NUM_V  0x00000003U
#define HP_SYSTEM_DEBUG_CH_NUM_S  0

