espressif/esp-idf/components/soc/esp32s31/register/soc/hp_system_reg.h
/** HP_SYSTEM_VPU_CTRL_REG register
 *  N/A
 */
#define HP_SYSTEM_VPU_CTRL_REG (DR_REG_HP_SYS_BASE + 0x158)
/** HP_SYSTEM_PPA_LSLP_MEM_PD : R/W; bitpos: [0]; default: 0;
 *  N/A
 */
#define HP_SYSTEM_PPA_LSLP_MEM_PD    (BIT(0))
#define HP_SYSTEM_PPA_LSLP_MEM_PD_M  (HP_SYSTEM_PPA_LSLP_MEM_PD_V << HP_SYSTEM_PPA_LSLP_MEM_PD_S)
#define HP_SYSTEM_PPA_LSLP_MEM_PD_V  0x00000001U
#define HP_SYSTEM_PPA_LSLP_MEM_PD_S  0
/** HP_SYSTEM_JPEG_SDSLP_MEM_PD : R/W; bitpos: [1]; default: 0;
 *  N/A
 */
#define HP_SYSTEM_JPEG_SDSLP_MEM_PD    (BIT(1))
#define HP_SYSTEM_JPEG_SDSLP_MEM_PD_M  (HP_SYSTEM_JPEG_SDSLP_MEM_PD_V << HP_SYSTEM_JPEG_SDSLP_MEM_PD_S)
#define HP_SYSTEM_JPEG_SDSLP_MEM_PD_V  0x00000001U
#define HP_SYSTEM_JPEG_SDSLP_MEM_PD_S  1
/** HP_SYSTEM_JPEG_LSLP_MEM_PD : R/W; bitpos: [2]; default: 0;
 *  N/A
 */
#define HP_SYSTEM_JPEG_LSLP_MEM_PD    (BIT(2))
#define HP_SYSTEM_JPEG_LSLP_MEM_PD_M  (HP_SYSTEM_JPEG_LSLP_MEM_PD_V << HP_SYSTEM_JPEG_LSLP_MEM_PD_S)
#define HP_SYSTEM_JPEG_LSLP_MEM_PD_V  0x00000001U
#define HP_SYSTEM_JPEG_LSLP_MEM_PD_S  2
/** HP_SYSTEM_JPEG_DSLP_MEM_PD : R/W; bitpos: [3]; default: 0;
 *  N/A
 */
#define HP_SYSTEM_JPEG_DSLP_MEM_PD    (BIT(3))
#define HP_SYSTEM_JPEG_DSLP_MEM_PD_M  (HP_SYSTEM_JPEG_DSLP_MEM_PD_V << HP_SYSTEM_JPEG_DSLP_MEM_PD_S)
#define HP_SYSTEM_JPEG_DSLP_MEM_PD_V  0x00000001U
#define HP_SYSTEM_JPEG_DSLP_MEM_PD_S  3
/** HP_SYSTEM_DMA2D_LSLP_MEM_PD : R/W; bitpos: [4]; default: 0;
 *  N/A
 */
#define HP_SYSTEM_DMA2D_LSLP_MEM_PD    (BIT(4))
#define HP_SYSTEM_DMA2D_LSLP_MEM_PD_M  (HP_SYSTEM_DMA2D_LSLP_MEM_PD_V << HP_SYSTEM_DMA2D_LSLP_MEM_PD_S)
#define HP_SYSTEM_DMA2D_LSLP_MEM_PD_V  0x00000001U
#define HP_SYSTEM_DMA2D_LSLP_MEM_PD_S  4

/** HP_SYSTEM_DESIGN_FOR_VERIFICATION0_REG register
 *  need_des
 */
#define HP_SYSTEM_DESIGN_FOR_VERIFICATION0_REG (DR_REG_HP_SYS_BASE + 0x170)
/** HP_SYSTEM_DFV0 : R/W; bitpos: [31:0]; default: 0;
 *  register for DV
 */
#define HP_SYSTEM_DFV0    0xFFFFFFFFU
#define HP_SYSTEM_DFV0_M  (HP_SYSTEM_DFV0_V << HP_SYSTEM_DFV0_S)
#define HP_SYSTEM_DFV0_V  0xFFFFFFFFU
#define HP_SYSTEM_DFV0_S  0

/** HP_SYSTEM_DESIGN_FOR_VERIFICATION1_REG register
 *  need_des
 */
#define HP_SYSTEM_DESIGN_FOR_VERIFICATION1_REG (DR_REG_HP_SYS_BASE + 0x174)
/** HP_SYSTEM_DFV1 : R/W; bitpos: [31:0]; default: 0;
 *  register for DV
 */
#define HP_SYSTEM_DFV1    0xFFFFFFFFU
#define HP_SYSTEM_DFV1_M  (HP_SYSTEM_DFV1_V << HP_SYSTEM_DFV1_S)
#define HP_SYSTEM_DFV1_V  0xFFFFFFFFU
#define HP_SYSTEM_DFV1_S  0

/** HP_SYSTEM_AHB2AXI_BRESP_ERR_INT_RAW_REG register
 *  NA
 */
#define HP_SYSTEM_AHB2AXI_BRESP_ERR_INT_RAW_REG (DR_REG_HP_SYS_BASE + 0x188)
/** HP_SYSTEM_SDMMC_ICM_H2X_BRESP_ERR_INT_RAW : R/WTC/SS; bitpos: [30]; default: 0;
 *  the raw interrupt status of bresp error,  triggered when if  bresp err occurs  in
 *  post write mode in ahb2axi.
 */
#define HP_SYSTEM_SDMMC_ICM_H2X_BRESP_ERR_INT_RAW    (BIT(30))
#define HP_SYSTEM_SDMMC_ICM_H2X_BRESP_ERR_INT_RAW_M  (HP_SYSTEM_SDMMC_ICM_H2X_BRESP_ERR_INT_RAW_V << HP_SYSTEM_SDMMC_ICM_H2X_BRESP_ERR_INT_RAW_S)
#define HP_SYSTEM_SDMMC_ICM_H2X_BRESP_ERR_INT_RAW_V  0x00000001U
#define HP_SYSTEM_SDMMC_ICM_H2X_BRESP_ERR_INT_RAW_S  30
/** HP_SYSTEM_CPU_ICM_H2X_BRESP_ERR_INT_RAW : R/WTC/SS; bitpos: [31]; default: 0;
 *  the raw interrupt status of bresp error,  triggered when if  bresp err occurs  in
 *  post write mode in ahb2axi.
 */
#define HP_SYSTEM_CPU_ICM_H2X_BRESP_ERR_INT_RAW    (BIT(31))
#define HP_SYSTEM_CPU_ICM_H2X_BRESP_ERR_INT_RAW_M  (HP_SYSTEM_CPU_ICM_H2X_BRESP_ERR_INT_RAW_V << HP_SYSTEM_CPU_ICM_H2X_BRESP_ERR_INT_RAW_S)
#define HP_SYSTEM_CPU_ICM_H2X_BRESP_ERR_INT_RAW_V  0x00000001U
#define HP_SYSTEM_CPU_ICM_H2X_BRESP_ERR_INT_RAW_S  31

/** HP_SYSTEM_AHB2AXI_BRESP_ERR_INT_ST_REG register
 *  need_des
 */
#define HP_SYSTEM_AHB2AXI_BRESP_ERR_INT_ST_REG (DR_REG_HP_SYS_BASE + 0x18c)
/** HP_SYSTEM_SDMMC_ICM_H2X_BRESP_ERR_INT_ST : RO; bitpos: [30]; default: 0;
 *  the masked interrupt status of  sdmmc_icm_h2x_bresp_err
 */
#define HP_SYSTEM_SDMMC_ICM_H2X_BRESP_ERR_INT_ST    (BIT(30))
#define HP_SYSTEM_SDMMC_ICM_H2X_BRESP_ERR_INT_ST_M  (HP_SYSTEM_SDMMC_ICM_H2X_BRESP_ERR_INT_ST_V << HP_SYSTEM_SDMMC_ICM_H2X_BRESP_ERR_INT_ST_S)
#define HP_SYSTEM_SDMMC_ICM_H2X_BRESP_ERR_INT_ST_V  0x00000001U
#define HP_SYSTEM_SDMMC_ICM_H2X_BRESP_ERR_INT_ST_S  30
/** HP_SYSTEM_CPU_ICM_H2X_BRESP_ERR_INT_ST : RO; bitpos: [31]; default: 0;
 *  the masked interrupt status of  cpu_icm_h2x_bresp_err
 */
#define HP_SYSTEM_CPU_ICM_H2X_BRESP_ERR_INT_ST    (BIT(31))
#define HP_SYSTEM_CPU_ICM_H2X_BRESP_ERR_INT_ST_M  (HP_SYSTEM_CPU_ICM_H2X_BRESP_ERR_INT_ST_V << HP_SYSTEM_CPU_ICM_H2X_BRESP_ERR_INT_ST_S)
#define HP_SYSTEM_CPU_ICM_H2X_BRESP_ERR_INT_ST_V  0x00000001U
#define HP_SYSTEM_CPU_ICM_H2X_BRESP_ERR_INT_ST_S  31

/** HP_SYSTEM_AHB2AXI_BRESP_ERR_INT_ENA_REG register
 *  need_des
 */
#define HP_SYSTEM_AHB2AXI_BRESP_ERR_INT_ENA_REG (DR_REG_HP_SYS_BASE + 0x190)
/** HP_SYSTEM_SDMMC_ICM_H2X_BRESP_ERR_INT_ENA : R/W; bitpos: [30]; default: 0;
 *  Write 1 to enable sdmmc_icm_h2x_bresp_err int
 */
#define HP_SYSTEM_SDMMC_ICM_H2X_BRESP_ERR_INT_ENA    (BIT(30))
#define HP_SYSTEM_SDMMC_ICM_H2X_BRESP_ERR_INT_ENA_M  (HP_SYSTEM_SDMMC_ICM_H2X_BRESP_ERR_INT_ENA_V << HP_SYSTEM_SDMMC_ICM_H2X_BRESP_ERR_INT_ENA_S)
#define HP_SYSTEM_SDMMC_ICM_H2X_BRESP_ERR_INT_ENA_V  0x00000001U
#define HP_SYSTEM_SDMMC_ICM_H2X_BRESP_ERR_INT_ENA_S  30
/** HP_SYSTEM_CPU_ICM_H2X_BRESP_ERR_INT_ENA : R/W; bitpos: [31]; default: 0;
 *  Write 1 to enable cpu_icm_h2x_bresp_err int
 */
#define HP_SYSTEM_CPU_ICM_H2X_BRESP_ERR_INT_ENA    (BIT(31))
#define HP_SYSTEM_CPU_ICM_H2X_BRESP_ERR_INT_ENA_M  (HP_SYSTEM_CPU_ICM_H2X_BRESP_ERR_INT_ENA_V << HP_SYSTEM_CPU_ICM_H2X_BRESP_ERR_INT_ENA_S)
#define HP_SYSTEM_CPU_ICM_H2X_BRESP_ERR_INT_ENA_V  0x00000001U
#define HP_SYSTEM_CPU_ICM_H2X_BRESP_ERR_INT_ENA_S  31

/** HP_SYSTEM_AHB2AXI_BRESP_ERR_INT_CLR_REG register
 *  need_des
 */
#define HP_SYSTEM_AHB2AXI_BRESP_ERR_INT_CLR_REG (DR_REG_HP_SYS_BASE + 0x194)
/** HP_SYSTEM_SDMMC_ICM_H2X_BRESP_ERR_INT_CLR : WT; bitpos: [30]; default: 0;
 *  Write 1 to clear sdmmc_icm_h2x_bresp_err  int
 */
#define HP_SYSTEM_SDMMC_ICM_H2X_BRESP_ERR_INT_CLR    (BIT(30))
#define HP_SYSTEM_SDMMC_ICM_H2X_BRESP_ERR_INT_CLR_M  (HP_SYSTEM_SDMMC_ICM_H2X_BRESP_ERR_INT_CLR_V << HP_SYSTEM_SDMMC_ICM_H2X_BRESP_ERR_INT_CLR_S)
#define HP_SYSTEM_SDMMC_ICM_H2X_BRESP_ERR_INT_CLR_V  0x00000001U
#define HP_SYSTEM_SDMMC_ICM_H2X_BRESP_ERR_INT_CLR_S  30
/** HP_SYSTEM_CPU_ICM_H2X_BRESP_ERR_INT_CLR : WT; bitpos: [31]; default: 0;
 *  Write 1 to clear cpu_icm_h2x_bresp_err  int
 */
#define HP_SYSTEM_CPU_ICM_H2X_BRESP_ERR_INT_CLR    (BIT(31))
#define HP_SYSTEM_CPU_ICM_H2X_BRESP_ERR_INT_CLR_M  (HP_SYSTEM_CPU_ICM_H2X_BRESP_ERR_INT_CLR_V << HP_SYSTEM_CPU_ICM_H2X_BRESP_ERR_INT_CLR_S)
#define HP_SYSTEM_CPU_ICM_H2X_BRESP_ERR_INT_CLR_V  0x00000001U
#define HP_SYSTEM_CPU_ICM_H2X_BRESP_ERR_INT_CLR_S  31

/** HP_SYSTEM_CORE_DMACTIVE_LPCORE_REG register
 *  need_des
 */
#define HP_SYSTEM_CORE_DMACTIVE_LPCORE_REG (DR_REG_HP_SYS_BASE + 0x1a0)
/** HP_SYSTEM_CORE_DMACTIVE_LPCORE : RO; bitpos: [0]; default: 0;
 *  hp core dmactive_lpcore value
 */
#define HP_SYSTEM_CORE_DMACTIVE_LPCORE    (BIT(0))
#define HP_SYSTEM_CORE_DMACTIVE_LPCORE_M  (HP_SYSTEM_CORE_DMACTIVE_LPCORE_V << HP_SYSTEM_CORE_DMACTIVE_LPCORE_S)
#define HP_SYSTEM_CORE_DMACTIVE_LPCORE_V  0x00000001U
#define HP_SYSTEM_CORE_DMACTIVE_LPCORE_S  0

/** HP_SYSTEM_CORE_ERR_RESP_DIS_REG register
 *  need_des
 */
#define HP_SYSTEM_CORE_ERR_RESP_DIS_REG (DR_REG_HP_SYS_BASE + 0x1a4)
/** HP_SYSTEM_CORE_ERR_RESP_DIS : R/W; bitpos: [2:0]; default: 0;
 *  Set bit0 to disable ibus err resp. Set bit1 to disable dbus err resp.  Set bit 2 to
 *  disable ahb err resp.
 */
#define HP_SYSTEM_CORE_ERR_RESP_DIS    0x00000007U
#define HP_SYSTEM_CORE_ERR_RESP_DIS_M  (HP_SYSTEM_CORE_ERR_RESP_DIS_V << HP_SYSTEM_CORE_ERR_RESP_DIS_S)
#define HP_SYSTEM_CORE_ERR_RESP_DIS_V  0x00000007U
#define HP_SYSTEM_CORE_ERR_RESP_DIS_S  0

