espressif/esp-idf/components/soc/esp32s31/register/soc/hp_system_reg.h
/** HP_SYSTEM_CORE_PAD_WAKEUP_EVENT_REG register
 *  pad wakeup event register
 */
#define HP_SYSTEM_CORE_PAD_WAKEUP_EVENT_REG (DR_REG_HP_SYS_BASE + 0x1b8)
/** HP_SYSTEM_CORE0_PAD_WAKEUP_EVENT : R/W; bitpos: [0]; default: 0;
 *  wakeup core0 register
 */
#define HP_SYSTEM_CORE0_PAD_WAKEUP_EVENT    (BIT(0))
#define HP_SYSTEM_CORE0_PAD_WAKEUP_EVENT_M  (HP_SYSTEM_CORE0_PAD_WAKEUP_EVENT_V << HP_SYSTEM_CORE0_PAD_WAKEUP_EVENT_S)
#define HP_SYSTEM_CORE0_PAD_WAKEUP_EVENT_V  0x00000001U
#define HP_SYSTEM_CORE0_PAD_WAKEUP_EVENT_S  0
/** HP_SYSTEM_CORE1_PAD_WAKEUP_EVENT : R/W; bitpos: [1]; default: 0;
 *  wakeup core1 register
 */
#define HP_SYSTEM_CORE1_PAD_WAKEUP_EVENT    (BIT(1))
#define HP_SYSTEM_CORE1_PAD_WAKEUP_EVENT_M  (HP_SYSTEM_CORE1_PAD_WAKEUP_EVENT_V << HP_SYSTEM_CORE1_PAD_WAKEUP_EVENT_S)
#define HP_SYSTEM_CORE1_PAD_WAKEUP_EVENT_V  0x00000001U
#define HP_SYSTEM_CORE1_PAD_WAKEUP_EVENT_S  1

/** HP_SYSTEM_TWAI0_TIMESTAMP_L_REG register
 *  twai0 timestamp low bit reg
 */
#define HP_SYSTEM_TWAI0_TIMESTAMP_L_REG (DR_REG_HP_SYS_BASE + 0x1c0)
/** HP_SYSTEM_TWAI0_TIMESTAMP_I : R/W; bitpos: [31:0]; default: 4294967295;
 *  This field used to set lower 32bits of timestamp hp twai0
 */
#define HP_SYSTEM_TWAI0_TIMESTAMP_I    0xFFFFFFFFU
#define HP_SYSTEM_TWAI0_TIMESTAMP_I_M  (HP_SYSTEM_TWAI0_TIMESTAMP_I_V << HP_SYSTEM_TWAI0_TIMESTAMP_I_S)
#define HP_SYSTEM_TWAI0_TIMESTAMP_I_V  0xFFFFFFFFU
#define HP_SYSTEM_TWAI0_TIMESTAMP_I_S  0

/** HP_SYSTEM_TWAI0_TIMESTAMP_H_REG register
 *  twai0 timestamp high bit reg
 */
#define HP_SYSTEM_TWAI0_TIMESTAMP_H_REG (DR_REG_HP_SYS_BASE + 0x1c4)
/** HP_SYSTEM_TWAI0_TIMESTAMP_H : R/W; bitpos: [31:0]; default: 4294967295;
 *  This field used to set upper 32bits of timestamp hp twai0
 */
#define HP_SYSTEM_TWAI0_TIMESTAMP_H    0xFFFFFFFFU
#define HP_SYSTEM_TWAI0_TIMESTAMP_H_M  (HP_SYSTEM_TWAI0_TIMESTAMP_H_V << HP_SYSTEM_TWAI0_TIMESTAMP_H_S)
#define HP_SYSTEM_TWAI0_TIMESTAMP_H_V  0xFFFFFFFFU
#define HP_SYSTEM_TWAI0_TIMESTAMP_H_S  0

/** HP_SYSTEM_TWAI1_TIMESTAMP_L_REG register
 *  twai1 timestamp low bit reg
 */
#define HP_SYSTEM_TWAI1_TIMESTAMP_L_REG (DR_REG_HP_SYS_BASE + 0x1c8)
/** HP_SYSTEM_TWAI1_TIMESTAMP_I : R/W; bitpos: [31:0]; default: 4294967295;
 *  This field used to set lower 32bits of timestamp hp twai1
 */
#define HP_SYSTEM_TWAI1_TIMESTAMP_I    0xFFFFFFFFU
#define HP_SYSTEM_TWAI1_TIMESTAMP_I_M  (HP_SYSTEM_TWAI1_TIMESTAMP_I_V << HP_SYSTEM_TWAI1_TIMESTAMP_I_S)
#define HP_SYSTEM_TWAI1_TIMESTAMP_I_V  0xFFFFFFFFU
#define HP_SYSTEM_TWAI1_TIMESTAMP_I_S  0

/** HP_SYSTEM_TWAI1_TIMESTAMP_H_REG register
 *  twai1 timestamp high bit reg
 */
#define HP_SYSTEM_TWAI1_TIMESTAMP_H_REG (DR_REG_HP_SYS_BASE + 0x1cc)
/** HP_SYSTEM_TWAI1_TIMESTAMP_H : R/W; bitpos: [31:0]; default: 4294967295;
 *  This field used to set upper 32bits of timestamp hp twai1
 */
#define HP_SYSTEM_TWAI1_TIMESTAMP_H    0xFFFFFFFFU
#define HP_SYSTEM_TWAI1_TIMESTAMP_H_M  (HP_SYSTEM_TWAI1_TIMESTAMP_H_V << HP_SYSTEM_TWAI1_TIMESTAMP_H_S)
#define HP_SYSTEM_TWAI1_TIMESTAMP_H_V  0xFFFFFFFFU
#define HP_SYSTEM_TWAI1_TIMESTAMP_H_S  0

/** HP_SYSTEM_RNG_CFG_REG register
 *  rng cfg register
 */
#define HP_SYSTEM_RNG_CFG_REG (DR_REG_HP_SYS_BASE + 0x1d8)
/** HP_SYSTEM_RNG_CHAIN_CLK_DIV_NUM : R/W; bitpos: [23:16]; default: 0;
 *  chain clk div num to pad for debug
 */
#define HP_SYSTEM_RNG_CHAIN_CLK_DIV_NUM    0x000000FFU
#define HP_SYSTEM_RNG_CHAIN_CLK_DIV_NUM_M  (HP_SYSTEM_RNG_CHAIN_CLK_DIV_NUM_V << HP_SYSTEM_RNG_CHAIN_CLK_DIV_NUM_S)
#define HP_SYSTEM_RNG_CHAIN_CLK_DIV_NUM_V  0x000000FFU
#define HP_SYSTEM_RNG_CHAIN_CLK_DIV_NUM_S  16

/** HP_SYSTEM_PERI_MEM_CLK_FORCE_ON_REG register
 *  hp peri mem clk force on regpster
 */
#define HP_SYSTEM_PERI_MEM_CLK_FORCE_ON_REG (DR_REG_HP_SYS_BASE + 0x1e0)
/** HP_SYSTEM_RMT_MEM_CLK_FORCE_ON : R/W; bitpos: [0]; default: 0;
 *  Set this bit to force on mem clk in rmt
 */
#define HP_SYSTEM_RMT_MEM_CLK_FORCE_ON    (BIT(0))
#define HP_SYSTEM_RMT_MEM_CLK_FORCE_ON_M  (HP_SYSTEM_RMT_MEM_CLK_FORCE_ON_V << HP_SYSTEM_RMT_MEM_CLK_FORCE_ON_S)
#define HP_SYSTEM_RMT_MEM_CLK_FORCE_ON_V  0x00000001U
#define HP_SYSTEM_RMT_MEM_CLK_FORCE_ON_S  0
/** HP_SYSTEM_BITSCRAMBLER_TX_MEM_CLK_FORCE_ON : R/W; bitpos: [1]; default: 0;
 *  Set this bit to force on tx mem clk in bitscrambler
 */
#define HP_SYSTEM_BITSCRAMBLER_TX_MEM_CLK_FORCE_ON    (BIT(1))
#define HP_SYSTEM_BITSCRAMBLER_TX_MEM_CLK_FORCE_ON_M  (HP_SYSTEM_BITSCRAMBLER_TX_MEM_CLK_FORCE_ON_V << HP_SYSTEM_BITSCRAMBLER_TX_MEM_CLK_FORCE_ON_S)
#define HP_SYSTEM_BITSCRAMBLER_TX_MEM_CLK_FORCE_ON_V  0x00000001U
#define HP_SYSTEM_BITSCRAMBLER_TX_MEM_CLK_FORCE_ON_S  1
/** HP_SYSTEM_BITSCRAMBLER_RX_MEM_CLK_FORCE_ON : R/W; bitpos: [2]; default: 0;
 *  Set this bit to force on rx mem clk in bitscrambler
 */
#define HP_SYSTEM_BITSCRAMBLER_RX_MEM_CLK_FORCE_ON    (BIT(2))
#define HP_SYSTEM_BITSCRAMBLER_RX_MEM_CLK_FORCE_ON_M  (HP_SYSTEM_BITSCRAMBLER_RX_MEM_CLK_FORCE_ON_V << HP_SYSTEM_BITSCRAMBLER_RX_MEM_CLK_FORCE_ON_S)
#define HP_SYSTEM_BITSCRAMBLER_RX_MEM_CLK_FORCE_ON_V  0x00000001U
#define HP_SYSTEM_BITSCRAMBLER_RX_MEM_CLK_FORCE_ON_S  2
/** HP_SYSTEM_GDMA_MEM_CLK_FORCE_ON : R/W; bitpos: [3]; default: 0;
 *  Set this bit to force on mem clk in gdma
 */
#define HP_SYSTEM_GDMA_MEM_CLK_FORCE_ON    (BIT(3))
#define HP_SYSTEM_GDMA_MEM_CLK_FORCE_ON_M  (HP_SYSTEM_GDMA_MEM_CLK_FORCE_ON_V << HP_SYSTEM_GDMA_MEM_CLK_FORCE_ON_S)
#define HP_SYSTEM_GDMA_MEM_CLK_FORCE_ON_V  0x00000001U
#define HP_SYSTEM_GDMA_MEM_CLK_FORCE_ON_S  3

/** HP_SYSTEM_PRDYN_ST_REG register
 *  hp system prdyn status register
 */
#define HP_SYSTEM_PRDYN_ST_REG (DR_REG_HP_SYS_BASE + 0x1e8)
/** HP_SYSTEM_ROM_PRDYN : RO; bitpos: [1]; default: 1;
 *  record memory power status
 */
#define HP_SYSTEM_ROM_PRDYN    (BIT(1))
#define HP_SYSTEM_ROM_PRDYN_M  (HP_SYSTEM_ROM_PRDYN_V << HP_SYSTEM_ROM_PRDYN_S)
#define HP_SYSTEM_ROM_PRDYN_V  0x00000001U
#define HP_SYSTEM_ROM_PRDYN_S  1
/** HP_SYSTEM_CPU_MEM_PRDYN : RO; bitpos: [3]; default: 1;
 *  record memory power status
 */
#define HP_SYSTEM_CPU_MEM_PRDYN    (BIT(3))
#define HP_SYSTEM_CPU_MEM_PRDYN_M  (HP_SYSTEM_CPU_MEM_PRDYN_V << HP_SYSTEM_CPU_MEM_PRDYN_S)
#define HP_SYSTEM_CPU_MEM_PRDYN_V  0x00000001U
#define HP_SYSTEM_CPU_MEM_PRDYN_S  3
/** HP_SYSTEM_BITSCRAMBLER_MEM_PRDYN : RO; bitpos: [4]; default: 1;
 *  record memory power status
 */
#define HP_SYSTEM_BITSCRAMBLER_MEM_PRDYN    (BIT(4))
#define HP_SYSTEM_BITSCRAMBLER_MEM_PRDYN_M  (HP_SYSTEM_BITSCRAMBLER_MEM_PRDYN_V << HP_SYSTEM_BITSCRAMBLER_MEM_PRDYN_S)
#define HP_SYSTEM_BITSCRAMBLER_MEM_PRDYN_V  0x00000001U
#define HP_SYSTEM_BITSCRAMBLER_MEM_PRDYN_S  4
/** HP_SYSTEM_USB_MEM_PRDYN : RO; bitpos: [6]; default: 1;
 *  record memory power status
 */
#define HP_SYSTEM_USB_MEM_PRDYN    (BIT(6))
#define HP_SYSTEM_USB_MEM_PRDYN_M  (HP_SYSTEM_USB_MEM_PRDYN_V << HP_SYSTEM_USB_MEM_PRDYN_S)
#define HP_SYSTEM_USB_MEM_PRDYN_V  0x00000001U
#define HP_SYSTEM_USB_MEM_PRDYN_S  6
/** HP_SYSTEM_RMT_MEM_PRDYN : RO; bitpos: [7]; default: 1;
 *  record memory power status
 */
#define HP_SYSTEM_RMT_MEM_PRDYN    (BIT(7))
#define HP_SYSTEM_RMT_MEM_PRDYN_M  (HP_SYSTEM_RMT_MEM_PRDYN_V << HP_SYSTEM_RMT_MEM_PRDYN_S)
#define HP_SYSTEM_RMT_MEM_PRDYN_V  0x00000001U
#define HP_SYSTEM_RMT_MEM_PRDYN_S  7
/** HP_SYSTEM_LEDC0_MEM_PRDYN : RO; bitpos: [8]; default: 1;
 *  record memory power status
 */
#define HP_SYSTEM_LEDC0_MEM_PRDYN    (BIT(8))
#define HP_SYSTEM_LEDC0_MEM_PRDYN_M  (HP_SYSTEM_LEDC0_MEM_PRDYN_V << HP_SYSTEM_LEDC0_MEM_PRDYN_S)
#define HP_SYSTEM_LEDC0_MEM_PRDYN_V  0x00000001U
#define HP_SYSTEM_LEDC0_MEM_PRDYN_S  8
/** HP_SYSTEM_KEY_MANAGER_MEM_PRDYN : RO; bitpos: [9]; default: 1;
 *  record memory power status
 */
#define HP_SYSTEM_KEY_MANAGER_MEM_PRDYN    (BIT(9))
#define HP_SYSTEM_KEY_MANAGER_MEM_PRDYN_M  (HP_SYSTEM_KEY_MANAGER_MEM_PRDYN_V << HP_SYSTEM_KEY_MANAGER_MEM_PRDYN_S)
#define HP_SYSTEM_KEY_MANAGER_MEM_PRDYN_V  0x00000001U
#define HP_SYSTEM_KEY_MANAGER_MEM_PRDYN_S  9
/** HP_SYSTEM_VPU_MEM_PRDYN : RO; bitpos: [10]; default: 1;
 *  record memory power status
 */
#define HP_SYSTEM_VPU_MEM_PRDYN    (BIT(10))
#define HP_SYSTEM_VPU_MEM_PRDYN_M  (HP_SYSTEM_VPU_MEM_PRDYN_V << HP_SYSTEM_VPU_MEM_PRDYN_S)
#define HP_SYSTEM_VPU_MEM_PRDYN_V  0x00000001U
#define HP_SYSTEM_VPU_MEM_PRDYN_S  10
/** HP_SYSTEM_GDMA_MEM_PRDYN : RO; bitpos: [12]; default: 1;
 *  record memory power status
 */
#define HP_SYSTEM_GDMA_MEM_PRDYN    (BIT(12))
#define HP_SYSTEM_GDMA_MEM_PRDYN_M  (HP_SYSTEM_GDMA_MEM_PRDYN_V << HP_SYSTEM_GDMA_MEM_PRDYN_S)
#define HP_SYSTEM_GDMA_MEM_PRDYN_V  0x00000001U
#define HP_SYSTEM_GDMA_MEM_PRDYN_S  12
/** HP_SYSTEM_UART_MEM_PRDYN : RO; bitpos: [14]; default: 1;
 *  record memory power status
 */
#define HP_SYSTEM_UART_MEM_PRDYN    (BIT(14))
#define HP_SYSTEM_UART_MEM_PRDYN_M  (HP_SYSTEM_UART_MEM_PRDYN_V << HP_SYSTEM_UART_MEM_PRDYN_S)
#define HP_SYSTEM_UART_MEM_PRDYN_V  0x00000001U
#define HP_SYSTEM_UART_MEM_PRDYN_S  14
/** HP_SYSTEM_CRYPTO_MEM_PRDYN : RO; bitpos: [15]; default: 1;
 *  record memory power status
 */
#define HP_SYSTEM_CRYPTO_MEM_PRDYN    (BIT(15))
#define HP_SYSTEM_CRYPTO_MEM_PRDYN_M  (HP_SYSTEM_CRYPTO_MEM_PRDYN_V << HP_SYSTEM_CRYPTO_MEM_PRDYN_S)
#define HP_SYSTEM_CRYPTO_MEM_PRDYN_V  0x00000001U
#define HP_SYSTEM_CRYPTO_MEM_PRDYN_S  15
/** HP_SYSTEM_FLASH_MSPI_MEM_PRDYN : RO; bitpos: [16]; default: 1;
 *  record memory power status
 */
#define HP_SYSTEM_FLASH_MSPI_MEM_PRDYN    (BIT(16))
#define HP_SYSTEM_FLASH_MSPI_MEM_PRDYN_M  (HP_SYSTEM_FLASH_MSPI_MEM_PRDYN_V << HP_SYSTEM_FLASH_MSPI_MEM_PRDYN_S)
#define HP_SYSTEM_FLASH_MSPI_MEM_PRDYN_V  0x00000001U
#define HP_SYSTEM_FLASH_MSPI_MEM_PRDYN_S  16
/** HP_SYSTEM_PSRAM_MSPI_MEM_PRDYN : RO; bitpos: [17]; default: 1;
 *  record memory power status
 */
#define HP_SYSTEM_PSRAM_MSPI_MEM_PRDYN    (BIT(17))
#define HP_SYSTEM_PSRAM_MSPI_MEM_PRDYN_M  (HP_SYSTEM_PSRAM_MSPI_MEM_PRDYN_V << HP_SYSTEM_PSRAM_MSPI_MEM_PRDYN_S)
#define HP_SYSTEM_PSRAM_MSPI_MEM_PRDYN_V  0x00000001U
#define HP_SYSTEM_PSRAM_MSPI_MEM_PRDYN_S  17
/** HP_SYSTEM_MODEM_MEM_PRDYN : RO; bitpos: [18]; default: 1;
 *  record memory power status
 */
#define HP_SYSTEM_MODEM_MEM_PRDYN    (BIT(18))
#define HP_SYSTEM_MODEM_MEM_PRDYN_M  (HP_SYSTEM_MODEM_MEM_PRDYN_V << HP_SYSTEM_MODEM_MEM_PRDYN_S)
#define HP_SYSTEM_MODEM_MEM_PRDYN_V  0x00000001U
#define HP_SYSTEM_MODEM_MEM_PRDYN_S  18
/** HP_SYSTEM_LEDC1_MEM_PRDYN : RO; bitpos: [19]; default: 1;
 *  record memory power status
 */
#define HP_SYSTEM_LEDC1_MEM_PRDYN    (BIT(19))
#define HP_SYSTEM_LEDC1_MEM_PRDYN_M  (HP_SYSTEM_LEDC1_MEM_PRDYN_V << HP_SYSTEM_LEDC1_MEM_PRDYN_S)
#define HP_SYSTEM_LEDC1_MEM_PRDYN_V  0x00000001U
#define HP_SYSTEM_LEDC1_MEM_PRDYN_S  19

/** HP_SYSTEM_ICM_CFG_REG register
 *  hp system axi icm ctrl register
 */
#define HP_SYSTEM_ICM_CFG_REG (DR_REG_HP_SYS_BASE + 0x1ec)
/** HP_SYSTEM_ICM_DIS_RD : R/W; bitpos: [2:0]; default: 0;
 *  0:mean master can access slave , 1:mean master can not rd slave ,will returen
 *  decerro on axi bus
 */
#define HP_SYSTEM_ICM_DIS_RD    0x00000007U
#define HP_SYSTEM_ICM_DIS_RD_M  (HP_SYSTEM_ICM_DIS_RD_V << HP_SYSTEM_ICM_DIS_RD_S)
#define HP_SYSTEM_ICM_DIS_RD_V  0x00000007U
#define HP_SYSTEM_ICM_DIS_RD_S  0
/** HP_SYSTEM_ICM_DIS_WR : R/W; bitpos: [5:3]; default: 0;
 *  0:mean master can access slave , 1:mean master can not wr slave ,will returen
 *  decerro on axi bus
 */
#define HP_SYSTEM_ICM_DIS_WR    0x00000007U
#define HP_SYSTEM_ICM_DIS_WR_M  (HP_SYSTEM_ICM_DIS_WR_V << HP_SYSTEM_ICM_DIS_WR_S)
#define HP_SYSTEM_ICM_DIS_WR_V  0x00000007U
#define HP_SYSTEM_ICM_DIS_WR_S  3
/** HP_SYSTEM_ICM_CFG_SECURE : R/W; bitpos: [8:6]; default: 0;
 *  axi_matrix slave ,0: non-secure, 1: secure , total 3 slave.
 */
#define HP_SYSTEM_ICM_CFG_SECURE    0x00000007U
#define HP_SYSTEM_ICM_CFG_SECURE_M  (HP_SYSTEM_ICM_CFG_SECURE_V << HP_SYSTEM_ICM_CFG_SECURE_S)
#define HP_SYSTEM_ICM_CFG_SECURE_V  0x00000007U
#define HP_SYSTEM_ICM_CFG_SECURE_S  6

