espressif/esp-idf/components/soc/esp32s31/register/soc/hp_system_reg.h
/** HP_SYSTEM_UART3_MEM_LP_CTRL_REG register
 *  uart memory power control register
 */
#define HP_SYSTEM_UART3_MEM_LP_CTRL_REG (DR_REG_HP_SYS_BASE + 0x1f0)
/** HP_SYSTEM_UART3_MEM_LP_MODE : R/W; bitpos: [1:0]; default: 2;
 *  Configures uart3 memory low power mode in low power stage.
 *  0(default): deep sleep
 *  1: light sleep
 *  2: shut down
 *  3: disable low power stage
 */
#define HP_SYSTEM_UART3_MEM_LP_MODE    0x00000003U
#define HP_SYSTEM_UART3_MEM_LP_MODE_M  (HP_SYSTEM_UART3_MEM_LP_MODE_V << HP_SYSTEM_UART3_MEM_LP_MODE_S)
#define HP_SYSTEM_UART3_MEM_LP_MODE_V  0x00000003U
#define HP_SYSTEM_UART3_MEM_LP_MODE_S  0
/** HP_SYSTEM_UART3_MEM_LP_EN : R/W; bitpos: [2]; default: 1;
 *  Set this bit to power down uart3 memory.
 */
#define HP_SYSTEM_UART3_MEM_LP_EN    (BIT(2))
#define HP_SYSTEM_UART3_MEM_LP_EN_M  (HP_SYSTEM_UART3_MEM_LP_EN_V << HP_SYSTEM_UART3_MEM_LP_EN_S)
#define HP_SYSTEM_UART3_MEM_LP_EN_V  0x00000001U
#define HP_SYSTEM_UART3_MEM_LP_EN_S  2
/** HP_SYSTEM_UART3_MEM_FORCE_CTRL : R/W; bitpos: [3]; default: 0;
 *  Set this bit to force software control uart3 memory, disable hardware control.
 */
#define HP_SYSTEM_UART3_MEM_FORCE_CTRL    (BIT(3))
#define HP_SYSTEM_UART3_MEM_FORCE_CTRL_M  (HP_SYSTEM_UART3_MEM_FORCE_CTRL_V << HP_SYSTEM_UART3_MEM_FORCE_CTRL_S)
#define HP_SYSTEM_UART3_MEM_FORCE_CTRL_V  0x00000001U
#define HP_SYSTEM_UART3_MEM_FORCE_CTRL_S  3

/** HP_SYSTEM_RMT_MEM_LP_CTRL_REG register
 *  rmt memory power control register
 */
#define HP_SYSTEM_RMT_MEM_LP_CTRL_REG (DR_REG_HP_SYS_BASE + 0x204)
/** HP_SYSTEM_RMT_MEM_LP_MODE : R/W; bitpos: [1:0]; default: 2;
 *  Configures rmt memory low power mode in low power stage.
 *  0(default): deep sleep
 *  1: light sleep
 *  2: shut down
 *  3: disable low power stage
 */
#define HP_SYSTEM_RMT_MEM_LP_MODE    0x00000003U
#define HP_SYSTEM_RMT_MEM_LP_MODE_M  (HP_SYSTEM_RMT_MEM_LP_MODE_V << HP_SYSTEM_RMT_MEM_LP_MODE_S)
#define HP_SYSTEM_RMT_MEM_LP_MODE_V  0x00000003U
#define HP_SYSTEM_RMT_MEM_LP_MODE_S  0
/** HP_SYSTEM_RMT_MEM_LP_EN : R/W; bitpos: [2]; default: 1;
 *  Set this bit to power down rmt memory.
 */
#define HP_SYSTEM_RMT_MEM_LP_EN    (BIT(2))
#define HP_SYSTEM_RMT_MEM_LP_EN_M  (HP_SYSTEM_RMT_MEM_LP_EN_V << HP_SYSTEM_RMT_MEM_LP_EN_S)
#define HP_SYSTEM_RMT_MEM_LP_EN_V  0x00000001U
#define HP_SYSTEM_RMT_MEM_LP_EN_S  2
/** HP_SYSTEM_RMT_MEM_LP_FORCE_CTRL : R/W; bitpos: [3]; default: 0;
 *  Set this bit to force software control rmt memory, disable hardware control.
 */
#define HP_SYSTEM_RMT_MEM_LP_FORCE_CTRL    (BIT(3))
#define HP_SYSTEM_RMT_MEM_LP_FORCE_CTRL_M  (HP_SYSTEM_RMT_MEM_LP_FORCE_CTRL_V << HP_SYSTEM_RMT_MEM_LP_FORCE_CTRL_S)
#define HP_SYSTEM_RMT_MEM_LP_FORCE_CTRL_V  0x00000001U
#define HP_SYSTEM_RMT_MEM_LP_FORCE_CTRL_S  3

/** HP_SYSTEM_LEDC0_MEM_LP_CTRL_REG register
 *  ledc0 memory power control register
 */
#define HP_SYSTEM_LEDC0_MEM_LP_CTRL_REG (DR_REG_HP_SYS_BASE + 0x208)
/** HP_SYSTEM_LEDC0_MEM_LP_MODE : R/W; bitpos: [1:0]; default: 2;
 *  Configures ledc0 memory low power mode in low power stage.
 *  0(default): deep sleep
 *  1: light sleep
 *  2: shut down
 *  3: disable low power stage
 */
#define HP_SYSTEM_LEDC0_MEM_LP_MODE    0x00000003U
#define HP_SYSTEM_LEDC0_MEM_LP_MODE_M  (HP_SYSTEM_LEDC0_MEM_LP_MODE_V << HP_SYSTEM_LEDC0_MEM_LP_MODE_S)
#define HP_SYSTEM_LEDC0_MEM_LP_MODE_V  0x00000003U
#define HP_SYSTEM_LEDC0_MEM_LP_MODE_S  0
/** HP_SYSTEM_LEDC0_MEM_LP_EN : R/W; bitpos: [2]; default: 1;
 *  Set this bit to power down ledc0 memory.
 */
#define HP_SYSTEM_LEDC0_MEM_LP_EN    (BIT(2))
#define HP_SYSTEM_LEDC0_MEM_LP_EN_M  (HP_SYSTEM_LEDC0_MEM_LP_EN_V << HP_SYSTEM_LEDC0_MEM_LP_EN_S)
#define HP_SYSTEM_LEDC0_MEM_LP_EN_V  0x00000001U
#define HP_SYSTEM_LEDC0_MEM_LP_EN_S  2
/** HP_SYSTEM_LEDC0_MEM_FORCE_CTRL : R/W; bitpos: [3]; default: 0;
 *  Set this bit to force software control ledc0 memory, disable hardware control.
 */
#define HP_SYSTEM_LEDC0_MEM_FORCE_CTRL    (BIT(3))
#define HP_SYSTEM_LEDC0_MEM_FORCE_CTRL_M  (HP_SYSTEM_LEDC0_MEM_FORCE_CTRL_V << HP_SYSTEM_LEDC0_MEM_FORCE_CTRL_S)
#define HP_SYSTEM_LEDC0_MEM_FORCE_CTRL_V  0x00000001U
#define HP_SYSTEM_LEDC0_MEM_FORCE_CTRL_S  3

/** HP_SYSTEM_KM_MEM_LP_CTRL_REG register
 *  key manager memory power control register
 */
#define HP_SYSTEM_KM_MEM_LP_CTRL_REG (DR_REG_HP_SYS_BASE + 0x20c)
/** HP_SYSTEM_KM_MEM_LP_MODE : R/W; bitpos: [1:0]; default: 2;
 *  Configures km memory low power mode in low power stage.
 *  0(default): deep sleep
 *  1: light sleep
 *  2: shut down
 *  3: disable low power stage
 */
#define HP_SYSTEM_KM_MEM_LP_MODE    0x00000003U
#define HP_SYSTEM_KM_MEM_LP_MODE_M  (HP_SYSTEM_KM_MEM_LP_MODE_V << HP_SYSTEM_KM_MEM_LP_MODE_S)
#define HP_SYSTEM_KM_MEM_LP_MODE_V  0x00000003U
#define HP_SYSTEM_KM_MEM_LP_MODE_S  0
/** HP_SYSTEM_KM_MEM_LP_EN : R/W; bitpos: [2]; default: 0;
 *  Set this bit to power down km memory.
 */
#define HP_SYSTEM_KM_MEM_LP_EN    (BIT(2))
#define HP_SYSTEM_KM_MEM_LP_EN_M  (HP_SYSTEM_KM_MEM_LP_EN_V << HP_SYSTEM_KM_MEM_LP_EN_S)
#define HP_SYSTEM_KM_MEM_LP_EN_V  0x00000001U
#define HP_SYSTEM_KM_MEM_LP_EN_S  2
/** HP_SYSTEM_KM_MEM_LP_FORCE_CTRL : R/W; bitpos: [3]; default: 0;
 *  Set this bit to force software control km memory, disable hardware control.
 */
#define HP_SYSTEM_KM_MEM_LP_FORCE_CTRL    (BIT(3))
#define HP_SYSTEM_KM_MEM_LP_FORCE_CTRL_M  (HP_SYSTEM_KM_MEM_LP_FORCE_CTRL_V << HP_SYSTEM_KM_MEM_LP_FORCE_CTRL_S)
#define HP_SYSTEM_KM_MEM_LP_FORCE_CTRL_V  0x00000001U
#define HP_SYSTEM_KM_MEM_LP_FORCE_CTRL_S  3

/** HP_SYSTEM_DMA2D_MEM_LP_CTRL_REG register
 *  vpu memory power control register
 */
#define HP_SYSTEM_DMA2D_MEM_LP_CTRL_REG (DR_REG_HP_SYS_BASE + 0x210)
/** HP_SYSTEM_2DDMA_MEM_LP_MODE : R/W; bitpos: [1:0]; default: 2;
 *  Configures 2ddma memory low power mode in low power stage.
 *  0(default): deep sleep
 *  1: light sleep
 *  2: shut down
 *  3: disable low power stage
 */
#define HP_SYSTEM_2DDMA_MEM_LP_MODE    0x00000003U
#define HP_SYSTEM_2DDMA_MEM_LP_MODE_M  (HP_SYSTEM_2DDMA_MEM_LP_MODE_V << HP_SYSTEM_2DDMA_MEM_LP_MODE_S)
#define HP_SYSTEM_2DDMA_MEM_LP_MODE_V  0x00000003U
#define HP_SYSTEM_2DDMA_MEM_LP_MODE_S  0
/** HP_SYSTEM_2DDMA_MEM_LP_EN : R/W; bitpos: [2]; default: 1;
 *  Set this bit to power down 2ddma memory.
 */
#define HP_SYSTEM_2DDMA_MEM_LP_EN    (BIT(2))
#define HP_SYSTEM_2DDMA_MEM_LP_EN_M  (HP_SYSTEM_2DDMA_MEM_LP_EN_V << HP_SYSTEM_2DDMA_MEM_LP_EN_S)
#define HP_SYSTEM_2DDMA_MEM_LP_EN_V  0x00000001U
#define HP_SYSTEM_2DDMA_MEM_LP_EN_S  2
/** HP_SYSTEM_2DDMA_MEM_FORCE_CTRL : R/W; bitpos: [3]; default: 0;
 *  Set this bit to force software control 2ddma memory, disable hardware control.
 */
#define HP_SYSTEM_2DDMA_MEM_FORCE_CTRL    (BIT(3))
#define HP_SYSTEM_2DDMA_MEM_FORCE_CTRL_M  (HP_SYSTEM_2DDMA_MEM_FORCE_CTRL_V << HP_SYSTEM_2DDMA_MEM_FORCE_CTRL_S)
#define HP_SYSTEM_2DDMA_MEM_FORCE_CTRL_V  0x00000001U
#define HP_SYSTEM_2DDMA_MEM_FORCE_CTRL_S  3

/** HP_SYSTEM_AXI_PDMA_MEM_LP_CTRL_REG register
 *  vpu memory power control register
 */
#define HP_SYSTEM_AXI_PDMA_MEM_LP_CTRL_REG (DR_REG_HP_SYS_BASE + 0x214)
/** HP_SYSTEM_AXI_PDMA_MEM_LP_MODE : R/W; bitpos: [1:0]; default: 0;
 *  Configures axi_pdma memory low power mode in low power stage.
 *  0(default): deep sleep
 *  1: light sleep
 *  2: shut down
 *  3: disable low power stage
 */
#define HP_SYSTEM_AXI_PDMA_MEM_LP_MODE    0x00000003U
#define HP_SYSTEM_AXI_PDMA_MEM_LP_MODE_M  (HP_SYSTEM_AXI_PDMA_MEM_LP_MODE_V << HP_SYSTEM_AXI_PDMA_MEM_LP_MODE_S)
#define HP_SYSTEM_AXI_PDMA_MEM_LP_MODE_V  0x00000003U
#define HP_SYSTEM_AXI_PDMA_MEM_LP_MODE_S  0
/** HP_SYSTEM_AXI_PDMA_MEM_LP_EN : R/W; bitpos: [2]; default: 0;
 *  Set this bit to power down axi_pdma memory.
 */
#define HP_SYSTEM_AXI_PDMA_MEM_LP_EN    (BIT(2))
#define HP_SYSTEM_AXI_PDMA_MEM_LP_EN_M  (HP_SYSTEM_AXI_PDMA_MEM_LP_EN_V << HP_SYSTEM_AXI_PDMA_MEM_LP_EN_S)
#define HP_SYSTEM_AXI_PDMA_MEM_LP_EN_V  0x00000001U
#define HP_SYSTEM_AXI_PDMA_MEM_LP_EN_S  2
/** HP_SYSTEM_AXI_PDMA_MEM_LP_FORCE_CTRL : R/W; bitpos: [3]; default: 0;
 *  Set this bit to force software control axi_pdma memory, disable hardware control.
 */
#define HP_SYSTEM_AXI_PDMA_MEM_LP_FORCE_CTRL    (BIT(3))
#define HP_SYSTEM_AXI_PDMA_MEM_LP_FORCE_CTRL_M  (HP_SYSTEM_AXI_PDMA_MEM_LP_FORCE_CTRL_V << HP_SYSTEM_AXI_PDMA_MEM_LP_FORCE_CTRL_S)
#define HP_SYSTEM_AXI_PDMA_MEM_LP_FORCE_CTRL_V  0x00000001U
#define HP_SYSTEM_AXI_PDMA_MEM_LP_FORCE_CTRL_S  3

/** HP_SYSTEM_ECC_MEM_LP_CTRL_REG register
 *  HP CORE0 & HP CORE1 memory power control register
 */
#define HP_SYSTEM_ECC_MEM_LP_CTRL_REG (DR_REG_HP_SYS_BASE + 0x218)
/** HP_SYSTEM_ECC_MEM_LP_MODE : R/W; bitpos: [1:0]; default: 2;
 *  Configures ecc memory low power mode in low power stage.
 *  0: deep sleep
 *  1: light sleep
 *  2(default): shut down
 *  3: disable low power stage
 */
#define HP_SYSTEM_ECC_MEM_LP_MODE    0x00000003U
#define HP_SYSTEM_ECC_MEM_LP_MODE_M  (HP_SYSTEM_ECC_MEM_LP_MODE_V << HP_SYSTEM_ECC_MEM_LP_MODE_S)
#define HP_SYSTEM_ECC_MEM_LP_MODE_V  0x00000003U
#define HP_SYSTEM_ECC_MEM_LP_MODE_S  0
/** HP_SYSTEM_ECC_MEM_LP_EN : R/W; bitpos: [2]; default: 0;
 *  Set this bit to power down ecc memory.
 */
#define HP_SYSTEM_ECC_MEM_LP_EN    (BIT(2))
#define HP_SYSTEM_ECC_MEM_LP_EN_M  (HP_SYSTEM_ECC_MEM_LP_EN_V << HP_SYSTEM_ECC_MEM_LP_EN_S)
#define HP_SYSTEM_ECC_MEM_LP_EN_V  0x00000001U
#define HP_SYSTEM_ECC_MEM_LP_EN_S  2
/** HP_SYSTEM_ECC_MEM_LP_FORCE_CTRL : R/W; bitpos: [3]; default: 0;
 *  Set this bit to force software control ecc memory, disable hardware control.
 */
#define HP_SYSTEM_ECC_MEM_LP_FORCE_CTRL    (BIT(3))
#define HP_SYSTEM_ECC_MEM_LP_FORCE_CTRL_M  (HP_SYSTEM_ECC_MEM_LP_FORCE_CTRL_V << HP_SYSTEM_ECC_MEM_LP_FORCE_CTRL_S)
#define HP_SYSTEM_ECC_MEM_LP_FORCE_CTRL_V  0x00000001U
#define HP_SYSTEM_ECC_MEM_LP_FORCE_CTRL_S  3

/** HP_SYSTEM_RSA_MEM_LP_CTRL_REG register
 *  HP CORE0 & HP CORE1 memory power control register
 */
#define HP_SYSTEM_RSA_MEM_LP_CTRL_REG (DR_REG_HP_SYS_BASE + 0x21c)
/** HP_SYSTEM_RSA_MEM_LP_MODE : R/W; bitpos: [1:0]; default: 2;
 *  Configures rsa memory low power mode in low power stage.
 *  0: deep sleep
 *  1: light sleep
 *  2(default): shut down
 *  3: disable low power stage
 */
#define HP_SYSTEM_RSA_MEM_LP_MODE    0x00000003U
#define HP_SYSTEM_RSA_MEM_LP_MODE_M  (HP_SYSTEM_RSA_MEM_LP_MODE_V << HP_SYSTEM_RSA_MEM_LP_MODE_S)
#define HP_SYSTEM_RSA_MEM_LP_MODE_V  0x00000003U
#define HP_SYSTEM_RSA_MEM_LP_MODE_S  0
/** HP_SYSTEM_RSA_MEM_LP_EN : R/W; bitpos: [2]; default: 0;
 *  Set this bit to power down rsa memory.
 */
#define HP_SYSTEM_RSA_MEM_LP_EN    (BIT(2))
#define HP_SYSTEM_RSA_MEM_LP_EN_M  (HP_SYSTEM_RSA_MEM_LP_EN_V << HP_SYSTEM_RSA_MEM_LP_EN_S)
#define HP_SYSTEM_RSA_MEM_LP_EN_V  0x00000001U
#define HP_SYSTEM_RSA_MEM_LP_EN_S  2
/** HP_SYSTEM_RSA_MEM_LP_FORCE_CTRL : R/W; bitpos: [3]; default: 0;
 *  Set this bit to force software control rsa memory, disable hardware control.
 */
#define HP_SYSTEM_RSA_MEM_LP_FORCE_CTRL    (BIT(3))
#define HP_SYSTEM_RSA_MEM_LP_FORCE_CTRL_M  (HP_SYSTEM_RSA_MEM_LP_FORCE_CTRL_V << HP_SYSTEM_RSA_MEM_LP_FORCE_CTRL_S)
#define HP_SYSTEM_RSA_MEM_LP_FORCE_CTRL_V  0x00000001U
#define HP_SYSTEM_RSA_MEM_LP_FORCE_CTRL_S  3

/** HP_SYSTEM_BITSCRAM_MEM_LP_CTRL_REG register
 *  HP CORE0 & HP CORE1 memory power control register
 */
#define HP_SYSTEM_BITSCRAM_MEM_LP_CTRL_REG (DR_REG_HP_SYS_BASE + 0x220)
/** HP_SYSTEM_BITSCRAM_MEM_LP_MODE : R/W; bitpos: [1:0]; default: 2;
 *  Configures bitscram memory low power mode in low power stage.
 *  0: deep sleep
 *  1: light sleep
 *  2(default): shut down
 *  3: disable low power stage
 */
#define HP_SYSTEM_BITSCRAM_MEM_LP_MODE    0x00000003U
#define HP_SYSTEM_BITSCRAM_MEM_LP_MODE_M  (HP_SYSTEM_BITSCRAM_MEM_LP_MODE_V << HP_SYSTEM_BITSCRAM_MEM_LP_MODE_S)
#define HP_SYSTEM_BITSCRAM_MEM_LP_MODE_V  0x00000003U
#define HP_SYSTEM_BITSCRAM_MEM_LP_MODE_S  0
/** HP_SYSTEM_BITSCRAM_MEM_LP_EN : R/W; bitpos: [2]; default: 1;
 *  Set this bit to power down bitscram memory.
 */
#define HP_SYSTEM_BITSCRAM_MEM_LP_EN    (BIT(2))
#define HP_SYSTEM_BITSCRAM_MEM_LP_EN_M  (HP_SYSTEM_BITSCRAM_MEM_LP_EN_V << HP_SYSTEM_BITSCRAM_MEM_LP_EN_S)
#define HP_SYSTEM_BITSCRAM_MEM_LP_EN_V  0x00000001U
#define HP_SYSTEM_BITSCRAM_MEM_LP_EN_S  2
/** HP_SYSTEM_BITSCRAM_MEM_LP_FORCE_CTRL : R/W; bitpos: [3]; default: 0;
 *  Set this bit to force software control bitscram memory, disable hardware control.
 */
#define HP_SYSTEM_BITSCRAM_MEM_LP_FORCE_CTRL    (BIT(3))
#define HP_SYSTEM_BITSCRAM_MEM_LP_FORCE_CTRL_M  (HP_SYSTEM_BITSCRAM_MEM_LP_FORCE_CTRL_V << HP_SYSTEM_BITSCRAM_MEM_LP_FORCE_CTRL_S)
#define HP_SYSTEM_BITSCRAM_MEM_LP_FORCE_CTRL_V  0x00000001U
#define HP_SYSTEM_BITSCRAM_MEM_LP_FORCE_CTRL_S  3

/** HP_SYSTEM_CAN0_MEM_LP_CTRL_REG register
 *  HP CORE0 & HP CORE1 memory power control register
 */
#define HP_SYSTEM_CAN0_MEM_LP_CTRL_REG (DR_REG_HP_SYS_BASE + 0x228)
/** HP_SYSTEM_CAN0_MEM_LP_MODE : R/W; bitpos: [1:0]; default: 2;
 *  Configures can0 memory low power mode in low power stage.
 *  0(default): deep sleep
 *  1: light sleep
 *  2: shut down
 *  3: disable low power stage
 */
#define HP_SYSTEM_CAN0_MEM_LP_MODE    0x00000003U
#define HP_SYSTEM_CAN0_MEM_LP_MODE_M  (HP_SYSTEM_CAN0_MEM_LP_MODE_V << HP_SYSTEM_CAN0_MEM_LP_MODE_S)
#define HP_SYSTEM_CAN0_MEM_LP_MODE_V  0x00000003U
#define HP_SYSTEM_CAN0_MEM_LP_MODE_S  0
/** HP_SYSTEM_CAN0_MEM_LP_EN : R/W; bitpos: [2]; default: 1;
 *  Set this bit to power down can0 memory.
 */
#define HP_SYSTEM_CAN0_MEM_LP_EN    (BIT(2))
#define HP_SYSTEM_CAN0_MEM_LP_EN_M  (HP_SYSTEM_CAN0_MEM_LP_EN_V << HP_SYSTEM_CAN0_MEM_LP_EN_S)
#define HP_SYSTEM_CAN0_MEM_LP_EN_V  0x00000001U
#define HP_SYSTEM_CAN0_MEM_LP_EN_S  2
/** HP_SYSTEM_CAN0_MEM_FORCE_CTRL : R/W; bitpos: [3]; default: 0;
 *  Set this bit to force software control can0 memory, disable hardware control.
 */
#define HP_SYSTEM_CAN0_MEM_FORCE_CTRL    (BIT(3))
#define HP_SYSTEM_CAN0_MEM_FORCE_CTRL_M  (HP_SYSTEM_CAN0_MEM_FORCE_CTRL_V << HP_SYSTEM_CAN0_MEM_FORCE_CTRL_S)
#define HP_SYSTEM_CAN0_MEM_FORCE_CTRL_V  0x00000001U
#define HP_SYSTEM_CAN0_MEM_FORCE_CTRL_S  3

/** HP_SYSTEM_MSPI_MEM_LP_CTRL_REG register
 *  HP CORE0 & HP CORE1 memory power control register
 */
#define HP_SYSTEM_MSPI_MEM_LP_CTRL_REG (DR_REG_HP_SYS_BASE + 0x234)
/** HP_SYSTEM_PSRAM_MSPI_MEM_LP_MODE : R/W; bitpos: [1:0]; default: 2;
 *  Configures psram_mspi memory low power mode in low power stage.
 *  0: deep sleep
 *  1: light sleep
 *  2(default): shut down
 *  3: disable low power stage
 */
#define HP_SYSTEM_PSRAM_MSPI_MEM_LP_MODE    0x00000003U
#define HP_SYSTEM_PSRAM_MSPI_MEM_LP_MODE_M  (HP_SYSTEM_PSRAM_MSPI_MEM_LP_MODE_V << HP_SYSTEM_PSRAM_MSPI_MEM_LP_MODE_S)
#define HP_SYSTEM_PSRAM_MSPI_MEM_LP_MODE_V  0x00000003U
#define HP_SYSTEM_PSRAM_MSPI_MEM_LP_MODE_S  0
/** HP_SYSTEM_PSRAM_MSPI_MEM_LP_EN : R/W; bitpos: [2]; default: 0;
 *  Set this bit to power down psram_mspi memory.
 */
#define HP_SYSTEM_PSRAM_MSPI_MEM_LP_EN    (BIT(2))
#define HP_SYSTEM_PSRAM_MSPI_MEM_LP_EN_M  (HP_SYSTEM_PSRAM_MSPI_MEM_LP_EN_V << HP_SYSTEM_PSRAM_MSPI_MEM_LP_EN_S)
#define HP_SYSTEM_PSRAM_MSPI_MEM_LP_EN_V  0x00000001U
#define HP_SYSTEM_PSRAM_MSPI_MEM_LP_EN_S  2
/** HP_SYSTEM_PSRAM_MSPI_MEM_LP_FORCE_CTRL : R/W; bitpos: [3]; default: 0;
 *  Set this bit to force software control psram_mspi memory, disable hardware control.
 */
#define HP_SYSTEM_PSRAM_MSPI_MEM_LP_FORCE_CTRL    (BIT(3))
#define HP_SYSTEM_PSRAM_MSPI_MEM_LP_FORCE_CTRL_M  (HP_SYSTEM_PSRAM_MSPI_MEM_LP_FORCE_CTRL_V << HP_SYSTEM_PSRAM_MSPI_MEM_LP_FORCE_CTRL_S)
#define HP_SYSTEM_PSRAM_MSPI_MEM_LP_FORCE_CTRL_V  0x00000001U
#define HP_SYSTEM_PSRAM_MSPI_MEM_LP_FORCE_CTRL_S  3
/** HP_SYSTEM_FLASH_MSPI_MEM_LP_MODE : R/W; bitpos: [5:4]; default: 2;
 *  Configures flash_mspi memory low power mode in low power stage.
 *  0: deep sleep
 *  1: light sleep
 *  2(default): shut down
 *  3: disable low power stage
 */
#define HP_SYSTEM_FLASH_MSPI_MEM_LP_MODE    0x00000003U
#define HP_SYSTEM_FLASH_MSPI_MEM_LP_MODE_M  (HP_SYSTEM_FLASH_MSPI_MEM_LP_MODE_V << HP_SYSTEM_FLASH_MSPI_MEM_LP_MODE_S)
#define HP_SYSTEM_FLASH_MSPI_MEM_LP_MODE_V  0x00000003U
#define HP_SYSTEM_FLASH_MSPI_MEM_LP_MODE_S  4
/** HP_SYSTEM_FLASH_MSPI_MEM_LP_EN : R/W; bitpos: [6]; default: 0;
 *  Set this bit to power down flash_mspi memory.
 */
#define HP_SYSTEM_FLASH_MSPI_MEM_LP_EN    (BIT(6))
#define HP_SYSTEM_FLASH_MSPI_MEM_LP_EN_M  (HP_SYSTEM_FLASH_MSPI_MEM_LP_EN_V << HP_SYSTEM_FLASH_MSPI_MEM_LP_EN_S)
#define HP_SYSTEM_FLASH_MSPI_MEM_LP_EN_V  0x00000001U
#define HP_SYSTEM_FLASH_MSPI_MEM_LP_EN_S  6
/** HP_SYSTEM_FLASH_MSPI_MEM_LP_FORCE_CTRL : R/W; bitpos: [7]; default: 0;
 *  Set this bit to force software control flash_mspi memory, disable hardware control.
 */
#define HP_SYSTEM_FLASH_MSPI_MEM_LP_FORCE_CTRL    (BIT(7))
#define HP_SYSTEM_FLASH_MSPI_MEM_LP_FORCE_CTRL_M  (HP_SYSTEM_FLASH_MSPI_MEM_LP_FORCE_CTRL_V << HP_SYSTEM_FLASH_MSPI_MEM_LP_FORCE_CTRL_S)
#define HP_SYSTEM_FLASH_MSPI_MEM_LP_FORCE_CTRL_V  0x00000001U
#define HP_SYSTEM_FLASH_MSPI_MEM_LP_FORCE_CTRL_S  7

