espressif/esp-idf/components/soc/esp32s31/register/soc/hp_system_reg.h
/** HP_SYSTEM_HPCORE_MEM_LP_CTRL_REG register
 *  HP CORE0 & HP CORE1 memory power control register
 */
#define HP_SYSTEM_HPCORE_MEM_LP_CTRL_REG (DR_REG_HP_SYS_BASE + 0x24c)
/** HP_SYSTEM_HPCORE_MEM_LP_MODE : R/W; bitpos: [1:0]; default: 0;
 *  Configures hpcore memory low power mode in low power stage.
 *  0: deep sleep
 *  1: light sleep
 *  2(default): shut down
 *  3: disable low power stage
 */
#define HP_SYSTEM_HPCORE_MEM_LP_MODE    0x00000003U
#define HP_SYSTEM_HPCORE_MEM_LP_MODE_M  (HP_SYSTEM_HPCORE_MEM_LP_MODE_V << HP_SYSTEM_HPCORE_MEM_LP_MODE_S)
#define HP_SYSTEM_HPCORE_MEM_LP_MODE_V  0x00000003U
#define HP_SYSTEM_HPCORE_MEM_LP_MODE_S  0
/** HP_SYSTEM_HPCORE_MEM_LP_EN : R/W; bitpos: [2]; default: 0;
 *  Set this bit to power down hpcore memory.
 */
#define HP_SYSTEM_HPCORE_MEM_LP_EN    (BIT(2))
#define HP_SYSTEM_HPCORE_MEM_LP_EN_M  (HP_SYSTEM_HPCORE_MEM_LP_EN_V << HP_SYSTEM_HPCORE_MEM_LP_EN_S)
#define HP_SYSTEM_HPCORE_MEM_LP_EN_V  0x00000001U
#define HP_SYSTEM_HPCORE_MEM_LP_EN_S  2
/** HP_SYSTEM_HPCORE_MEM_LP_FORCE_CTRL : R/W; bitpos: [3]; default: 0;
 *  Set this bit to force software control hpcore memory, disable hardware control.
 */
#define HP_SYSTEM_HPCORE_MEM_LP_FORCE_CTRL    (BIT(3))
#define HP_SYSTEM_HPCORE_MEM_LP_FORCE_CTRL_M  (HP_SYSTEM_HPCORE_MEM_LP_FORCE_CTRL_V << HP_SYSTEM_HPCORE_MEM_LP_FORCE_CTRL_S)
#define HP_SYSTEM_HPCORE_MEM_LP_FORCE_CTRL_V  0x00000001U
#define HP_SYSTEM_HPCORE_MEM_LP_FORCE_CTRL_S  3

/** HP_SYSTEM_ROM_MEM_LP_CTRL_REG register
 *  rom power control register
 */
#define HP_SYSTEM_ROM_MEM_LP_CTRL_REG (DR_REG_HP_SYS_BASE + 0x250)
/** HP_SYSTEM_ROM_MEM_LP_MODE : R/W; bitpos: [1:0]; default: 2;
 *  Configures rom low power mode in low power stage.
 *  0(default): deep sleep
 *  1: light sleep
 *  2: shut down
 *  3: disable low power stage
 */
#define HP_SYSTEM_ROM_MEM_LP_MODE    0x00000003U
#define HP_SYSTEM_ROM_MEM_LP_MODE_M  (HP_SYSTEM_ROM_MEM_LP_MODE_V << HP_SYSTEM_ROM_MEM_LP_MODE_S)
#define HP_SYSTEM_ROM_MEM_LP_MODE_V  0x00000003U
#define HP_SYSTEM_ROM_MEM_LP_MODE_S  0
/** HP_SYSTEM_ROM_MEM_LP_EN : R/W; bitpos: [3:2]; default: 0;
 *  Set this bit to power down rom.
 */
#define HP_SYSTEM_ROM_MEM_LP_EN    0x00000003U
#define HP_SYSTEM_ROM_MEM_LP_EN_M  (HP_SYSTEM_ROM_MEM_LP_EN_V << HP_SYSTEM_ROM_MEM_LP_EN_S)
#define HP_SYSTEM_ROM_MEM_LP_EN_V  0x00000003U
#define HP_SYSTEM_ROM_MEM_LP_EN_S  2
/** HP_SYSTEM_ROM_MEM_LP_FORCE_CTRL : R/W; bitpos: [5:4]; default: 0;
 *  Set this bit to force software control rom, disable hardware control.
 */
#define HP_SYSTEM_ROM_MEM_LP_FORCE_CTRL    0x00000003U
#define HP_SYSTEM_ROM_MEM_LP_FORCE_CTRL_M  (HP_SYSTEM_ROM_MEM_LP_FORCE_CTRL_V << HP_SYSTEM_ROM_MEM_LP_FORCE_CTRL_S)
#define HP_SYSTEM_ROM_MEM_LP_FORCE_CTRL_V  0x00000003U
#define HP_SYSTEM_ROM_MEM_LP_FORCE_CTRL_S  4

/** HP_SYSTEM_L1_CACHE_MEM_LP_CTRL_REG register
 *  HP CORE0 & HP CORE1 memory power control register
 */
#define HP_SYSTEM_L1_CACHE_MEM_LP_CTRL_REG (DR_REG_HP_SYS_BASE + 0x25c)
/** HP_SYSTEM_L1_CACHE_MEM_LP_MODE : R/W; bitpos: [1:0]; default: 2;
 *  Configures l1_cache memory low power mode in low power stage.
 *  0: deep sleep
 *  1: light sleep
 *  2(default): shut down
 *  3: disable low power stage
 */
#define HP_SYSTEM_L1_CACHE_MEM_LP_MODE    0x00000003U
#define HP_SYSTEM_L1_CACHE_MEM_LP_MODE_M  (HP_SYSTEM_L1_CACHE_MEM_LP_MODE_V << HP_SYSTEM_L1_CACHE_MEM_LP_MODE_S)
#define HP_SYSTEM_L1_CACHE_MEM_LP_MODE_V  0x00000003U
#define HP_SYSTEM_L1_CACHE_MEM_LP_MODE_S  0
/** HP_SYSTEM_L1_CACHE_MEM_LP_EN : R/W; bitpos: [2]; default: 0;
 *  Set this bit to power down l1_cache memory.
 */
#define HP_SYSTEM_L1_CACHE_MEM_LP_EN    (BIT(2))
#define HP_SYSTEM_L1_CACHE_MEM_LP_EN_M  (HP_SYSTEM_L1_CACHE_MEM_LP_EN_V << HP_SYSTEM_L1_CACHE_MEM_LP_EN_S)
#define HP_SYSTEM_L1_CACHE_MEM_LP_EN_V  0x00000001U
#define HP_SYSTEM_L1_CACHE_MEM_LP_EN_S  2
/** HP_SYSTEM_L1_CACHE_MEM_LP_FORCE_CTRL : R/W; bitpos: [3]; default: 0;
 *  Set this bit to force software control l1_cache memory, disable hardware control.
 */
#define HP_SYSTEM_L1_CACHE_MEM_LP_FORCE_CTRL    (BIT(3))
#define HP_SYSTEM_L1_CACHE_MEM_LP_FORCE_CTRL_M  (HP_SYSTEM_L1_CACHE_MEM_LP_FORCE_CTRL_V << HP_SYSTEM_L1_CACHE_MEM_LP_FORCE_CTRL_S)
#define HP_SYSTEM_L1_CACHE_MEM_LP_FORCE_CTRL_V  0x00000001U
#define HP_SYSTEM_L1_CACHE_MEM_LP_FORCE_CTRL_S  3

/** HP_SYSTEM_KYBER_MEM_LP_CTRL_REG register
 *  HP CORE0 & HP CORE1 memory power control register
 */
#define HP_SYSTEM_KYBER_MEM_LP_CTRL_REG (DR_REG_HP_SYS_BASE + 0x260)
/** HP_SYSTEM_KYBER_MEM_LP_MODE : R/W; bitpos: [1:0]; default: 2;
 *  Configures kyber memory low power mode in low power stage.
 *  0: deep sleep
 *  1: light sleep
 *  2(default): shut down
 *  3: disable low power stage
 */
#define HP_SYSTEM_KYBER_MEM_LP_MODE    0x00000003U
#define HP_SYSTEM_KYBER_MEM_LP_MODE_M  (HP_SYSTEM_KYBER_MEM_LP_MODE_V << HP_SYSTEM_KYBER_MEM_LP_MODE_S)
#define HP_SYSTEM_KYBER_MEM_LP_MODE_V  0x00000003U
#define HP_SYSTEM_KYBER_MEM_LP_MODE_S  0
/** HP_SYSTEM_KYBER_MEM_LP_EN : R/W; bitpos: [2]; default: 1;
 *  Set this bit to power down kyber memory.
 */
#define HP_SYSTEM_KYBER_MEM_LP_EN    (BIT(2))
#define HP_SYSTEM_KYBER_MEM_LP_EN_M  (HP_SYSTEM_KYBER_MEM_LP_EN_V << HP_SYSTEM_KYBER_MEM_LP_EN_S)
#define HP_SYSTEM_KYBER_MEM_LP_EN_V  0x00000001U
#define HP_SYSTEM_KYBER_MEM_LP_EN_S  2
/** HP_SYSTEM_KYBER_MEM_LP_FORCE_CTRL : R/W; bitpos: [3]; default: 0;
 *  Set this bit to force software control kyber memory, disable hardware control.
 */
#define HP_SYSTEM_KYBER_MEM_LP_FORCE_CTRL    (BIT(3))
#define HP_SYSTEM_KYBER_MEM_LP_FORCE_CTRL_M  (HP_SYSTEM_KYBER_MEM_LP_FORCE_CTRL_V << HP_SYSTEM_KYBER_MEM_LP_FORCE_CTRL_S)
#define HP_SYSTEM_KYBER_MEM_LP_FORCE_CTRL_V  0x00000001U
#define HP_SYSTEM_KYBER_MEM_LP_FORCE_CTRL_S  3

/** HP_SYSTEM_LCDCAM_MEM_LP_CTRL_REG register
 *  HP CORE0 & HP CORE1 memory power control register
 */
#define HP_SYSTEM_LCDCAM_MEM_LP_CTRL_REG (DR_REG_HP_SYS_BASE + 0x264)
/** HP_SYSTEM_LCDCAM_MEM_LP_MODE : R/W; bitpos: [1:0]; default: 2;
 *  Configures lcdcam memory low power mode in low power stage.
 *  0: deep sleep
 *  1: light sleep
 *  2(default): shut down
 *  3: disable low power stage
 */
#define HP_SYSTEM_LCDCAM_MEM_LP_MODE    0x00000003U
#define HP_SYSTEM_LCDCAM_MEM_LP_MODE_M  (HP_SYSTEM_LCDCAM_MEM_LP_MODE_V << HP_SYSTEM_LCDCAM_MEM_LP_MODE_S)
#define HP_SYSTEM_LCDCAM_MEM_LP_MODE_V  0x00000003U
#define HP_SYSTEM_LCDCAM_MEM_LP_MODE_S  0
/** HP_SYSTEM_LCDCAM_MEM_LP_EN : R/W; bitpos: [2]; default: 1;
 *  Set this bit to power down lcdcam memory.
 */
#define HP_SYSTEM_LCDCAM_MEM_LP_EN    (BIT(2))
#define HP_SYSTEM_LCDCAM_MEM_LP_EN_M  (HP_SYSTEM_LCDCAM_MEM_LP_EN_V << HP_SYSTEM_LCDCAM_MEM_LP_EN_S)
#define HP_SYSTEM_LCDCAM_MEM_LP_EN_V  0x00000001U
#define HP_SYSTEM_LCDCAM_MEM_LP_EN_S  2
/** HP_SYSTEM_LCDCAM_MEM_LP_FORCE_CTRL : R/W; bitpos: [3]; default: 0;
 *  Set this bit to force software control lcdcam memory, disable hardware control.
 */
#define HP_SYSTEM_LCDCAM_MEM_LP_FORCE_CTRL    (BIT(3))
#define HP_SYSTEM_LCDCAM_MEM_LP_FORCE_CTRL_M  (HP_SYSTEM_LCDCAM_MEM_LP_FORCE_CTRL_V << HP_SYSTEM_LCDCAM_MEM_LP_FORCE_CTRL_S)
#define HP_SYSTEM_LCDCAM_MEM_LP_FORCE_CTRL_V  0x00000001U
#define HP_SYSTEM_LCDCAM_MEM_LP_FORCE_CTRL_S  3

/** HP_SYSTEM_CPU_PERI0_TIMEOUT_CONF_REG register
 *  CPU_PERI0_TIMEOUT configuration register
 */
#define HP_SYSTEM_CPU_PERI0_TIMEOUT_CONF_REG (DR_REG_HP_SYS_BASE + 0x268)
/** HP_SYSTEM_CPU_PERI0_TIMEOUT_THRES : R/W; bitpos: [15:0]; default: 65535;
 *  Configures the timeout threshold for bus access for accessing CPU peripheral0
 *  register in the number of clock cycles of the clock domain.
 */
#define HP_SYSTEM_CPU_PERI0_TIMEOUT_THRES    0x0000FFFFU
#define HP_SYSTEM_CPU_PERI0_TIMEOUT_THRES_M  (HP_SYSTEM_CPU_PERI0_TIMEOUT_THRES_V << HP_SYSTEM_CPU_PERI0_TIMEOUT_THRES_S)
#define HP_SYSTEM_CPU_PERI0_TIMEOUT_THRES_V  0x0000FFFFU
#define HP_SYSTEM_CPU_PERI0_TIMEOUT_THRES_S  0
/** HP_SYSTEM_CPU_PERI0_TIMEOUT_INT_CLR : WT; bitpos: [16]; default: 0;
 *  Write 1 to clear timeout interrupt.
 */
#define HP_SYSTEM_CPU_PERI0_TIMEOUT_INT_CLR    (BIT(16))
#define HP_SYSTEM_CPU_PERI0_TIMEOUT_INT_CLR_M  (HP_SYSTEM_CPU_PERI0_TIMEOUT_INT_CLR_V << HP_SYSTEM_CPU_PERI0_TIMEOUT_INT_CLR_S)
#define HP_SYSTEM_CPU_PERI0_TIMEOUT_INT_CLR_V  0x00000001U
#define HP_SYSTEM_CPU_PERI0_TIMEOUT_INT_CLR_S  16
/** HP_SYSTEM_CPU_PERI0_TIMEOUT_PROTECT_EN : R/W; bitpos: [17]; default: 1;
 *  Configures whether or not to enable timeout protection for accessing CPU
 *  peripheral0 registers.
 *  0: Disable
 *  1: Enable
 */
#define HP_SYSTEM_CPU_PERI0_TIMEOUT_PROTECT_EN    (BIT(17))
#define HP_SYSTEM_CPU_PERI0_TIMEOUT_PROTECT_EN_M  (HP_SYSTEM_CPU_PERI0_TIMEOUT_PROTECT_EN_V << HP_SYSTEM_CPU_PERI0_TIMEOUT_PROTECT_EN_S)
#define HP_SYSTEM_CPU_PERI0_TIMEOUT_PROTECT_EN_V  0x00000001U
#define HP_SYSTEM_CPU_PERI0_TIMEOUT_PROTECT_EN_S  17

/** HP_SYSTEM_CPU_PERI0_TIMEOUT_ADDR_REG register
 *  CPU_PERI0_TIMEOUT_ADDR register
 */
#define HP_SYSTEM_CPU_PERI0_TIMEOUT_ADDR_REG (DR_REG_HP_SYS_BASE + 0x26c)
/** HP_SYSTEM_CPU_PERI0_TIMEOUT_ADDR : RO; bitpos: [31:0]; default: 0;
 *  Represents the address information of abnormal access.
 */
#define HP_SYSTEM_CPU_PERI0_TIMEOUT_ADDR    0xFFFFFFFFU
#define HP_SYSTEM_CPU_PERI0_TIMEOUT_ADDR_M  (HP_SYSTEM_CPU_PERI0_TIMEOUT_ADDR_V << HP_SYSTEM_CPU_PERI0_TIMEOUT_ADDR_S)
#define HP_SYSTEM_CPU_PERI0_TIMEOUT_ADDR_V  0xFFFFFFFFU
#define HP_SYSTEM_CPU_PERI0_TIMEOUT_ADDR_S  0

/** HP_SYSTEM_CPU_PERI0_TIMEOUT_UID_REG register
 *  CPU_PERI0_TIMEOUT_UID register
 */
#define HP_SYSTEM_CPU_PERI0_TIMEOUT_UID_REG (DR_REG_HP_SYS_BASE + 0x270)
/** HP_SYSTEM_CPU_PERI0_TIMEOUT_UID : RO; bitpos: [7:0]; default: 0;
 *  Represents the master id[5:0] and master permission[6:5] when trigger timeout. This
 *  register will be cleared after the interrupt is cleared.
 */
#define HP_SYSTEM_CPU_PERI0_TIMEOUT_UID    0x000000FFU
#define HP_SYSTEM_CPU_PERI0_TIMEOUT_UID_M  (HP_SYSTEM_CPU_PERI0_TIMEOUT_UID_V << HP_SYSTEM_CPU_PERI0_TIMEOUT_UID_S)
#define HP_SYSTEM_CPU_PERI0_TIMEOUT_UID_V  0x000000FFU
#define HP_SYSTEM_CPU_PERI0_TIMEOUT_UID_S  0

/** HP_SYSTEM_HP_SYSTEM_PERI0_TIMEOUT_CONF_REG register
 *  HP_SYSTEM_PERI0_TIMEOUT configuration register
 */
#define HP_SYSTEM_HP_SYSTEM_PERI0_TIMEOUT_CONF_REG (DR_REG_HP_SYS_BASE + 0x274)
/** HP_SYSTEM_HP_SYSTEM_PERI0_TIMEOUT_THRES : R/W; bitpos: [15:0]; default: 65535;
 *  Configures the timeout threshold for bus access for accessing CPU peripheral
 *  register in the number of clock cycles of the clock domain.
 */
#define HP_SYSTEM_HP_SYSTEM_PERI0_TIMEOUT_THRES    0x0000FFFFU
#define HP_SYSTEM_HP_SYSTEM_PERI0_TIMEOUT_THRES_M  (HP_SYSTEM_HP_SYSTEM_PERI0_TIMEOUT_THRES_V << HP_SYSTEM_HP_SYSTEM_PERI0_TIMEOUT_THRES_S)
#define HP_SYSTEM_HP_SYSTEM_PERI0_TIMEOUT_THRES_V  0x0000FFFFU
#define HP_SYSTEM_HP_SYSTEM_PERI0_TIMEOUT_THRES_S  0
/** HP_SYSTEM_HP_SYSTEM_PERI0_TIMEOUT_INT_CLR : WT; bitpos: [16]; default: 0;
 *  Write 1 to clear timeout interrupt.
 */
#define HP_SYSTEM_HP_SYSTEM_PERI0_TIMEOUT_INT_CLR    (BIT(16))
#define HP_SYSTEM_HP_SYSTEM_PERI0_TIMEOUT_INT_CLR_M  (HP_SYSTEM_HP_SYSTEM_PERI0_TIMEOUT_INT_CLR_V << HP_SYSTEM_HP_SYSTEM_PERI0_TIMEOUT_INT_CLR_S)
#define HP_SYSTEM_HP_SYSTEM_PERI0_TIMEOUT_INT_CLR_V  0x00000001U
#define HP_SYSTEM_HP_SYSTEM_PERI0_TIMEOUT_INT_CLR_S  16
/** HP_SYSTEM_HP_SYSTEM_PERI0_TIMEOUT_PROTECT_EN : R/W; bitpos: [17]; default: 1;
 *  Configures whether or not to enable timeout protection for accessing CPU peripheral
 *  registers.
 *  0: Disable
 *  1: Enable
 */
#define HP_SYSTEM_HP_SYSTEM_PERI0_TIMEOUT_PROTECT_EN    (BIT(17))
#define HP_SYSTEM_HP_SYSTEM_PERI0_TIMEOUT_PROTECT_EN_M  (HP_SYSTEM_HP_SYSTEM_PERI0_TIMEOUT_PROTECT_EN_V << HP_SYSTEM_HP_SYSTEM_PERI0_TIMEOUT_PROTECT_EN_S)
#define HP_SYSTEM_HP_SYSTEM_PERI0_TIMEOUT_PROTECT_EN_V  0x00000001U
#define HP_SYSTEM_HP_SYSTEM_PERI0_TIMEOUT_PROTECT_EN_S  17

/** HP_SYSTEM_HP_SYSTEM_PERI0_TIMEOUT_ADDR_REG register
 *  HP_SYSTEM_PERI0_TIMEOUT_ADDR register
 */
#define HP_SYSTEM_HP_SYSTEM_PERI0_TIMEOUT_ADDR_REG (DR_REG_HP_SYS_BASE + 0x278)
/** HP_SYSTEM_HP_SYSTEM_PERI0_TIMEOUT_ADDR : RO; bitpos: [31:0]; default: 0;
 *  Represents the address information of abnormal access.
 */
#define HP_SYSTEM_HP_SYSTEM_PERI0_TIMEOUT_ADDR    0xFFFFFFFFU
#define HP_SYSTEM_HP_SYSTEM_PERI0_TIMEOUT_ADDR_M  (HP_SYSTEM_HP_SYSTEM_PERI0_TIMEOUT_ADDR_V << HP_SYSTEM_HP_SYSTEM_PERI0_TIMEOUT_ADDR_S)
#define HP_SYSTEM_HP_SYSTEM_PERI0_TIMEOUT_ADDR_V  0xFFFFFFFFU
#define HP_SYSTEM_HP_SYSTEM_PERI0_TIMEOUT_ADDR_S  0

/** HP_SYSTEM_HP_SYSTEM_PERI0_TIMEOUT_UID_REG register
 *  HP_SYSTEM_PERI0_TIMEOUT_UID register
 */
#define HP_SYSTEM_HP_SYSTEM_PERI0_TIMEOUT_UID_REG (DR_REG_HP_SYS_BASE + 0x27c)
/** HP_SYSTEM_HP_SYSTEM_PERI0_TIMEOUT_UID : RO; bitpos: [7:0]; default: 0;
 *  Represents the master id[5:0] and master permission[6:5] when trigger timeout. This
 *  register will be cleared after the interrupt is cleared.
 */
#define HP_SYSTEM_HP_SYSTEM_PERI0_TIMEOUT_UID    0x000000FFU
#define HP_SYSTEM_HP_SYSTEM_PERI0_TIMEOUT_UID_M  (HP_SYSTEM_HP_SYSTEM_PERI0_TIMEOUT_UID_V << HP_SYSTEM_HP_SYSTEM_PERI0_TIMEOUT_UID_S)
#define HP_SYSTEM_HP_SYSTEM_PERI0_TIMEOUT_UID_V  0x000000FFU
#define HP_SYSTEM_HP_SYSTEM_PERI0_TIMEOUT_UID_S  0

/** HP_SYSTEM_HP_SYSTEM_PERI1_TIMEOUT_CONF_REG register
 *  HP_SYSTEM_PERI1_TIMEOUT configuration register
 */
#define HP_SYSTEM_HP_SYSTEM_PERI1_TIMEOUT_CONF_REG (DR_REG_HP_SYS_BASE + 0x280)
/** HP_SYSTEM_HP_SYSTEM_PERI1_TIMEOUT_THRES : R/W; bitpos: [15:0]; default: 65535;
 *  Configures the timeout threshold for bus access for accessing CPU peripheral
 *  register in the number of clock cycles of the clock domain.
 */
#define HP_SYSTEM_HP_SYSTEM_PERI1_TIMEOUT_THRES    0x0000FFFFU
#define HP_SYSTEM_HP_SYSTEM_PERI1_TIMEOUT_THRES_M  (HP_SYSTEM_HP_SYSTEM_PERI1_TIMEOUT_THRES_V << HP_SYSTEM_HP_SYSTEM_PERI1_TIMEOUT_THRES_S)
#define HP_SYSTEM_HP_SYSTEM_PERI1_TIMEOUT_THRES_V  0x0000FFFFU
#define HP_SYSTEM_HP_SYSTEM_PERI1_TIMEOUT_THRES_S  0
/** HP_SYSTEM_HP_SYSTEM_PERI1_TIMEOUT_INT_CLR : WT; bitpos: [16]; default: 0;
 *  Write 1 to clear timeout interrupt.
 */
#define HP_SYSTEM_HP_SYSTEM_PERI1_TIMEOUT_INT_CLR    (BIT(16))
#define HP_SYSTEM_HP_SYSTEM_PERI1_TIMEOUT_INT_CLR_M  (HP_SYSTEM_HP_SYSTEM_PERI1_TIMEOUT_INT_CLR_V << HP_SYSTEM_HP_SYSTEM_PERI1_TIMEOUT_INT_CLR_S)
#define HP_SYSTEM_HP_SYSTEM_PERI1_TIMEOUT_INT_CLR_V  0x00000001U
#define HP_SYSTEM_HP_SYSTEM_PERI1_TIMEOUT_INT_CLR_S  16
/** HP_SYSTEM_HP_SYSTEM_PERI1_TIMEOUT_PROTECT_EN : R/W; bitpos: [17]; default: 1;
 *  Configures whether or not to enable timeout protection for accessing CPU peripheral
 *  registers.
 *  0: Disable
 *  1: Enable
 */
#define HP_SYSTEM_HP_SYSTEM_PERI1_TIMEOUT_PROTECT_EN    (BIT(17))
#define HP_SYSTEM_HP_SYSTEM_PERI1_TIMEOUT_PROTECT_EN_M  (HP_SYSTEM_HP_SYSTEM_PERI1_TIMEOUT_PROTECT_EN_V << HP_SYSTEM_HP_SYSTEM_PERI1_TIMEOUT_PROTECT_EN_S)
#define HP_SYSTEM_HP_SYSTEM_PERI1_TIMEOUT_PROTECT_EN_V  0x00000001U
#define HP_SYSTEM_HP_SYSTEM_PERI1_TIMEOUT_PROTECT_EN_S  17

