espressif/esp-idf/components/soc/esp32s31/register/soc/hp_system_reg.h
/** HP_SYSTEM_CPU_PERI1_TIMEOUT_ADDR_REG register
 *  CPU_PERI1_TIMEOUT_ADDR register
 */
#define HP_SYSTEM_CPU_PERI1_TIMEOUT_ADDR_REG (DR_REG_HP_SYS_BASE + 0x2ac)
/** HP_SYSTEM_CPU_PERI1_TIMEOUT_ADDR : RO; bitpos: [31:0]; default: 0;
 *  Represents the address information of abnormal access.
 */
#define HP_SYSTEM_CPU_PERI1_TIMEOUT_ADDR    0xFFFFFFFFU
#define HP_SYSTEM_CPU_PERI1_TIMEOUT_ADDR_M  (HP_SYSTEM_CPU_PERI1_TIMEOUT_ADDR_V << HP_SYSTEM_CPU_PERI1_TIMEOUT_ADDR_S)
#define HP_SYSTEM_CPU_PERI1_TIMEOUT_ADDR_V  0xFFFFFFFFU
#define HP_SYSTEM_CPU_PERI1_TIMEOUT_ADDR_S  0

/** HP_SYSTEM_CPU_PERI1_TIMEOUT_UID_REG register
 *  CPU_PERI1_TIMEOUT_UID register
 */
#define HP_SYSTEM_CPU_PERI1_TIMEOUT_UID_REG (DR_REG_HP_SYS_BASE + 0x2b0)
/** HP_SYSTEM_CPU_PERI1_TIMEOUT_UID : RO; bitpos: [7:0]; default: 0;
 *  Represents the master id[5:0] and master permission[6:5] when trigger timeout. This
 *  register will be cleared after the interrupt is cleared.
 */
#define HP_SYSTEM_CPU_PERI1_TIMEOUT_UID    0x000000FFU
#define HP_SYSTEM_CPU_PERI1_TIMEOUT_UID_M  (HP_SYSTEM_CPU_PERI1_TIMEOUT_UID_V << HP_SYSTEM_CPU_PERI1_TIMEOUT_UID_S)
#define HP_SYSTEM_CPU_PERI1_TIMEOUT_UID_V  0x000000FFU
#define HP_SYSTEM_CPU_PERI1_TIMEOUT_UID_S  0

/** HP_SYSTEM_CPU_ACS_CACHE_MEM_CONF_REG register
 *  CPU access Cache data mem configuration register
 */
#define HP_SYSTEM_CPU_ACS_CACHE_MEM_CONF_REG (DR_REG_HP_SYS_BASE + 0x2b4)
/** HP_SYSTEM_CPU_ACCESS_AC0_DATAMEM_EN : HRO; bitpos: [0]; default: 0;
 *  Set this bit to enable CPU accessROMCache0 data mem path
 */
#define HP_SYSTEM_CPU_ACCESS_AC0_DATAMEM_EN    (BIT(0))
#define HP_SYSTEM_CPU_ACCESS_AC0_DATAMEM_EN_M  (HP_SYSTEM_CPU_ACCESS_AC0_DATAMEM_EN_V << HP_SYSTEM_CPU_ACCESS_AC0_DATAMEM_EN_S)
#define HP_SYSTEM_CPU_ACCESS_AC0_DATAMEM_EN_V  0x00000001U
#define HP_SYSTEM_CPU_ACCESS_AC0_DATAMEM_EN_S  0
/** HP_SYSTEM_CPU_ACCESS_AC1_DATAMEM_EN : HRO; bitpos: [1]; default: 0;
 *  Set this bit to enable CPU access ROMCache1 data mem path
 */
#define HP_SYSTEM_CPU_ACCESS_AC1_DATAMEM_EN    (BIT(1))
#define HP_SYSTEM_CPU_ACCESS_AC1_DATAMEM_EN_M  (HP_SYSTEM_CPU_ACCESS_AC1_DATAMEM_EN_V << HP_SYSTEM_CPU_ACCESS_AC1_DATAMEM_EN_S)
#define HP_SYSTEM_CPU_ACCESS_AC1_DATAMEM_EN_V  0x00000001U
#define HP_SYSTEM_CPU_ACCESS_AC1_DATAMEM_EN_S  1
/** HP_SYSTEM_CPU_ACCESS_IC0_DATAMEM_EN : R/W; bitpos: [2]; default: 0;
 *  Set this bit to enable CPU access ICache0 data mem path
 */
#define HP_SYSTEM_CPU_ACCESS_IC0_DATAMEM_EN    (BIT(2))
#define HP_SYSTEM_CPU_ACCESS_IC0_DATAMEM_EN_M  (HP_SYSTEM_CPU_ACCESS_IC0_DATAMEM_EN_V << HP_SYSTEM_CPU_ACCESS_IC0_DATAMEM_EN_S)
#define HP_SYSTEM_CPU_ACCESS_IC0_DATAMEM_EN_V  0x00000001U
#define HP_SYSTEM_CPU_ACCESS_IC0_DATAMEM_EN_S  2
/** HP_SYSTEM_CPU_ACCESS_IC1_DATAMEM_EN : R/W; bitpos: [3]; default: 0;
 *  Set this bit to enable CPU access ICache1 data mem path
 */
#define HP_SYSTEM_CPU_ACCESS_IC1_DATAMEM_EN    (BIT(3))
#define HP_SYSTEM_CPU_ACCESS_IC1_DATAMEM_EN_M  (HP_SYSTEM_CPU_ACCESS_IC1_DATAMEM_EN_V << HP_SYSTEM_CPU_ACCESS_IC1_DATAMEM_EN_S)
#define HP_SYSTEM_CPU_ACCESS_IC1_DATAMEM_EN_V  0x00000001U
#define HP_SYSTEM_CPU_ACCESS_IC1_DATAMEM_EN_S  3
/** HP_SYSTEM_CPU_ACCESS_DC_DATAMEM_EN : R/W; bitpos: [4]; default: 0;
 *  Set this bit to enable CPU access DCache data mem path
 */
#define HP_SYSTEM_CPU_ACCESS_DC_DATAMEM_EN    (BIT(4))
#define HP_SYSTEM_CPU_ACCESS_DC_DATAMEM_EN_M  (HP_SYSTEM_CPU_ACCESS_DC_DATAMEM_EN_V << HP_SYSTEM_CPU_ACCESS_DC_DATAMEM_EN_S)
#define HP_SYSTEM_CPU_ACCESS_DC_DATAMEM_EN_V  0x00000001U
#define HP_SYSTEM_CPU_ACCESS_DC_DATAMEM_EN_S  4
/** HP_SYSTEM_CPU_ACS_CACHE_MEM_LOCK : R/W; bitpos: [5]; default: 0;
 *  Set 1 to lock cpu acs mem data mem path configuration
 */
#define HP_SYSTEM_CPU_ACS_CACHE_MEM_LOCK    (BIT(5))
#define HP_SYSTEM_CPU_ACS_CACHE_MEM_LOCK_M  (HP_SYSTEM_CPU_ACS_CACHE_MEM_LOCK_V << HP_SYSTEM_CPU_ACS_CACHE_MEM_LOCK_S)
#define HP_SYSTEM_CPU_ACS_CACHE_MEM_LOCK_V  0x00000001U
#define HP_SYSTEM_CPU_ACS_CACHE_MEM_LOCK_S  5

/** HP_SYSTEM_TCM_PERFORMACE_CTRL_REG register
 *  need_des
 */
#define HP_SYSTEM_TCM_PERFORMACE_CTRL_REG (DR_REG_HP_SYS_BASE + 0x2e0)
/** HP_SYSTEM_AHB_TO_TCM_MEM_EN_HOLD : R/W; bitpos: [0]; default: 0;
 *  Set 1 to keep TCM mem enable hold when mem access is busy.
 */
#define HP_SYSTEM_AHB_TO_TCM_MEM_EN_HOLD    (BIT(0))
#define HP_SYSTEM_AHB_TO_TCM_MEM_EN_HOLD_M  (HP_SYSTEM_AHB_TO_TCM_MEM_EN_HOLD_V << HP_SYSTEM_AHB_TO_TCM_MEM_EN_HOLD_S)
#define HP_SYSTEM_AHB_TO_TCM_MEM_EN_HOLD_V  0x00000001U
#define HP_SYSTEM_AHB_TO_TCM_MEM_EN_HOLD_S  0

/** HP_SYSTEM_SDIO_PAD_BIST_CFG_REG register
 *  sdio pad bist control register
 */
#define HP_SYSTEM_SDIO_PAD_BIST_CFG_REG (DR_REG_HP_SYS_BASE + 0x2e4)
/** HP_SYSTEM_SDIO_PAD_BIST_START : WT; bitpos: [0]; default: 0;
 *  Write 1 to start sdio pad bist
 */
#define HP_SYSTEM_SDIO_PAD_BIST_START    (BIT(0))
#define HP_SYSTEM_SDIO_PAD_BIST_START_M  (HP_SYSTEM_SDIO_PAD_BIST_START_V << HP_SYSTEM_SDIO_PAD_BIST_START_S)
#define HP_SYSTEM_SDIO_PAD_BIST_START_V  0x00000001U
#define HP_SYSTEM_SDIO_PAD_BIST_START_S  0

/** HP_SYSTEM_SDIO_PAD_BIST_INT_RAW_REG register
 *  sdio pad bist interrupt raw register
 */
#define HP_SYSTEM_SDIO_PAD_BIST_INT_RAW_REG (DR_REG_HP_SYS_BASE + 0x2e8)
/** HP_SYSTEM_SDIO_PAD_BIST_OK_INT_RAW : R/WTC/SS; bitpos: [0]; default: 0;
 *  intr triggered when bist finish and status is bist ok
 */
#define HP_SYSTEM_SDIO_PAD_BIST_OK_INT_RAW    (BIT(0))
#define HP_SYSTEM_SDIO_PAD_BIST_OK_INT_RAW_M  (HP_SYSTEM_SDIO_PAD_BIST_OK_INT_RAW_V << HP_SYSTEM_SDIO_PAD_BIST_OK_INT_RAW_S)
#define HP_SYSTEM_SDIO_PAD_BIST_OK_INT_RAW_V  0x00000001U
#define HP_SYSTEM_SDIO_PAD_BIST_OK_INT_RAW_S  0
/** HP_SYSTEM_SDIO_PAD_BIST_FAIL_INT_RAW : R/WTC/SS; bitpos: [1]; default: 0;
 *  intr triggered when bist finish and status is bist fail
 */
#define HP_SYSTEM_SDIO_PAD_BIST_FAIL_INT_RAW    (BIT(1))
#define HP_SYSTEM_SDIO_PAD_BIST_FAIL_INT_RAW_M  (HP_SYSTEM_SDIO_PAD_BIST_FAIL_INT_RAW_V << HP_SYSTEM_SDIO_PAD_BIST_FAIL_INT_RAW_S)
#define HP_SYSTEM_SDIO_PAD_BIST_FAIL_INT_RAW_V  0x00000001U
#define HP_SYSTEM_SDIO_PAD_BIST_FAIL_INT_RAW_S  1

/** HP_SYSTEM_SDIO_PAD_BIST_INT_ST_REG register
 *  masked interrupt register
 */
#define HP_SYSTEM_SDIO_PAD_BIST_INT_ST_REG (DR_REG_HP_SYS_BASE + 0x2ec)
/** HP_SYSTEM_SDIO_PAD_BIST_OK_INT_ST : RO; bitpos: [0]; default: 0;
 *  the masked interrupt status of sdio pad bist ok interrupt
 */
#define HP_SYSTEM_SDIO_PAD_BIST_OK_INT_ST    (BIT(0))
#define HP_SYSTEM_SDIO_PAD_BIST_OK_INT_ST_M  (HP_SYSTEM_SDIO_PAD_BIST_OK_INT_ST_V << HP_SYSTEM_SDIO_PAD_BIST_OK_INT_ST_S)
#define HP_SYSTEM_SDIO_PAD_BIST_OK_INT_ST_V  0x00000001U
#define HP_SYSTEM_SDIO_PAD_BIST_OK_INT_ST_S  0
/** HP_SYSTEM_SDIO_PAD_BIST_FAIL_INT_ST : RO; bitpos: [1]; default: 0;
 *  the masked interrupt status of sdio pad bist fail interrupt
 */
#define HP_SYSTEM_SDIO_PAD_BIST_FAIL_INT_ST    (BIT(1))
#define HP_SYSTEM_SDIO_PAD_BIST_FAIL_INT_ST_M  (HP_SYSTEM_SDIO_PAD_BIST_FAIL_INT_ST_V << HP_SYSTEM_SDIO_PAD_BIST_FAIL_INT_ST_S)
#define HP_SYSTEM_SDIO_PAD_BIST_FAIL_INT_ST_V  0x00000001U
#define HP_SYSTEM_SDIO_PAD_BIST_FAIL_INT_ST_S  1

