espressif/esp-idf/components/soc/esp32s31/register/soc/hp_system_reg.h
/** HP_SYSTEM_SDIO_PAD_BIST_INT_ENA_REG register
 *  interrupt enable register
 */
#define HP_SYSTEM_SDIO_PAD_BIST_INT_ENA_REG (DR_REG_HP_SYS_BASE + 0x2f0)
/** HP_SYSTEM_SDIO_PAD_BIST_OK_INT_ENA : R/W; bitpos: [0]; default: 0;
 *  Write 1 to enable sdio pad bist ok interrupt
 */
#define HP_SYSTEM_SDIO_PAD_BIST_OK_INT_ENA    (BIT(0))
#define HP_SYSTEM_SDIO_PAD_BIST_OK_INT_ENA_M  (HP_SYSTEM_SDIO_PAD_BIST_OK_INT_ENA_V << HP_SYSTEM_SDIO_PAD_BIST_OK_INT_ENA_S)
#define HP_SYSTEM_SDIO_PAD_BIST_OK_INT_ENA_V  0x00000001U
#define HP_SYSTEM_SDIO_PAD_BIST_OK_INT_ENA_S  0
/** HP_SYSTEM_SDIO_PAD_BIST_FAIL_INT_ENA : R/W; bitpos: [1]; default: 0;
 *  Write 1 to enable sdio pad bist fail interrupt
 */
#define HP_SYSTEM_SDIO_PAD_BIST_FAIL_INT_ENA    (BIT(1))
#define HP_SYSTEM_SDIO_PAD_BIST_FAIL_INT_ENA_M  (HP_SYSTEM_SDIO_PAD_BIST_FAIL_INT_ENA_V << HP_SYSTEM_SDIO_PAD_BIST_FAIL_INT_ENA_S)
#define HP_SYSTEM_SDIO_PAD_BIST_FAIL_INT_ENA_V  0x00000001U
#define HP_SYSTEM_SDIO_PAD_BIST_FAIL_INT_ENA_S  1

/** HP_SYSTEM_SDIO_PAD_BIST_INT_CLR_REG register
 *  interrupt clear register
 */
#define HP_SYSTEM_SDIO_PAD_BIST_INT_CLR_REG (DR_REG_HP_SYS_BASE + 0x2f4)
/** HP_SYSTEM_SDIO_PAD_BIST_OK_INT_CLR : WT; bitpos: [0]; default: 0;
 *  Write 1 to clr sdio pad bist ok interrupt
 */
#define HP_SYSTEM_SDIO_PAD_BIST_OK_INT_CLR    (BIT(0))
#define HP_SYSTEM_SDIO_PAD_BIST_OK_INT_CLR_M  (HP_SYSTEM_SDIO_PAD_BIST_OK_INT_CLR_V << HP_SYSTEM_SDIO_PAD_BIST_OK_INT_CLR_S)
#define HP_SYSTEM_SDIO_PAD_BIST_OK_INT_CLR_V  0x00000001U
#define HP_SYSTEM_SDIO_PAD_BIST_OK_INT_CLR_S  0
/** HP_SYSTEM_SDIO_PAD_BIST_FAIL_INT_CLR : WT; bitpos: [1]; default: 0;
 *  Write 1 to clr sdio pad bist fail interrupt
 */
#define HP_SYSTEM_SDIO_PAD_BIST_FAIL_INT_CLR    (BIT(1))
#define HP_SYSTEM_SDIO_PAD_BIST_FAIL_INT_CLR_M  (HP_SYSTEM_SDIO_PAD_BIST_FAIL_INT_CLR_V << HP_SYSTEM_SDIO_PAD_BIST_FAIL_INT_CLR_S)
#define HP_SYSTEM_SDIO_PAD_BIST_FAIL_INT_CLR_V  0x00000001U
#define HP_SYSTEM_SDIO_PAD_BIST_FAIL_INT_CLR_S  1

/** HP_SYSTEM_SDIO_PAD_BIST_ST_REG register
 *  sdio pad bist status register
 */
#define HP_SYSTEM_SDIO_PAD_BIST_ST_REG (DR_REG_HP_SYS_BASE + 0x2f8)
/** HP_SYSTEM_SDIO_PAD_BIST_RCNT : RO; bitpos: [5:0]; default: 0;
 *  Indicate number of clock cycles received for pad bist debug
 */
#define HP_SYSTEM_SDIO_PAD_BIST_RCNT    0x0000003FU
#define HP_SYSTEM_SDIO_PAD_BIST_RCNT_M  (HP_SYSTEM_SDIO_PAD_BIST_RCNT_V << HP_SYSTEM_SDIO_PAD_BIST_RCNT_S)
#define HP_SYSTEM_SDIO_PAD_BIST_RCNT_V  0x0000003FU
#define HP_SYSTEM_SDIO_PAD_BIST_RCNT_S  0

/** HP_SYSTEM_GMAC0_PAD_BIST_CFG_REG register
 *  gmac0 pad bist control register
 */
#define HP_SYSTEM_GMAC0_PAD_BIST_CFG_REG (DR_REG_HP_SYS_BASE + 0x2fc)
/** HP_SYSTEM_GMAC0_PAD_BIST_START : WT; bitpos: [0]; default: 0;
 *  Write 1 to start gmac0 pad bist
 */
#define HP_SYSTEM_GMAC0_PAD_BIST_START    (BIT(0))
#define HP_SYSTEM_GMAC0_PAD_BIST_START_M  (HP_SYSTEM_GMAC0_PAD_BIST_START_V << HP_SYSTEM_GMAC0_PAD_BIST_START_S)
#define HP_SYSTEM_GMAC0_PAD_BIST_START_V  0x00000001U
#define HP_SYSTEM_GMAC0_PAD_BIST_START_S  0

/** HP_SYSTEM_GMAC0_PAD_BIST_INT_RAW_REG register
 *  gmac0 pad bist interrupt raw register
 */
#define HP_SYSTEM_GMAC0_PAD_BIST_INT_RAW_REG (DR_REG_HP_SYS_BASE + 0x300)
/** HP_SYSTEM_GMAC0_PAD_BIST_OK_INT_RAW : R/WTC/SS; bitpos: [0]; default: 0;
 *  intr triggered when bist finish and status is bist ok
 */
#define HP_SYSTEM_GMAC0_PAD_BIST_OK_INT_RAW    (BIT(0))
#define HP_SYSTEM_GMAC0_PAD_BIST_OK_INT_RAW_M  (HP_SYSTEM_GMAC0_PAD_BIST_OK_INT_RAW_V << HP_SYSTEM_GMAC0_PAD_BIST_OK_INT_RAW_S)
#define HP_SYSTEM_GMAC0_PAD_BIST_OK_INT_RAW_V  0x00000001U
#define HP_SYSTEM_GMAC0_PAD_BIST_OK_INT_RAW_S  0
/** HP_SYSTEM_GMAC0_PAD_BIST_FAIL_INT_RAW : R/WTC/SS; bitpos: [1]; default: 0;
 *  intr triggered when bist finish and status is bist fail
 */
#define HP_SYSTEM_GMAC0_PAD_BIST_FAIL_INT_RAW    (BIT(1))
#define HP_SYSTEM_GMAC0_PAD_BIST_FAIL_INT_RAW_M  (HP_SYSTEM_GMAC0_PAD_BIST_FAIL_INT_RAW_V << HP_SYSTEM_GMAC0_PAD_BIST_FAIL_INT_RAW_S)
#define HP_SYSTEM_GMAC0_PAD_BIST_FAIL_INT_RAW_V  0x00000001U
#define HP_SYSTEM_GMAC0_PAD_BIST_FAIL_INT_RAW_S  1

/** HP_SYSTEM_GMAC0_PAD_BIST_INT_ST_REG register
 *  masked interrupt register
 */
#define HP_SYSTEM_GMAC0_PAD_BIST_INT_ST_REG (DR_REG_HP_SYS_BASE + 0x304)
/** HP_SYSTEM_GMAC0_PAD_BIST_OK_INT_ST : RO; bitpos: [0]; default: 0;
 *  the masked interrupt status of gmac0 pad bist ok interrupt
 */
#define HP_SYSTEM_GMAC0_PAD_BIST_OK_INT_ST    (BIT(0))
#define HP_SYSTEM_GMAC0_PAD_BIST_OK_INT_ST_M  (HP_SYSTEM_GMAC0_PAD_BIST_OK_INT_ST_V << HP_SYSTEM_GMAC0_PAD_BIST_OK_INT_ST_S)
#define HP_SYSTEM_GMAC0_PAD_BIST_OK_INT_ST_V  0x00000001U
#define HP_SYSTEM_GMAC0_PAD_BIST_OK_INT_ST_S  0
/** HP_SYSTEM_GMAC0_PAD_BIST_FAIL_INT_ST : RO; bitpos: [1]; default: 0;
 *  the masked interrupt status of gmac0 pad bist fail interrupt
 */
#define HP_SYSTEM_GMAC0_PAD_BIST_FAIL_INT_ST    (BIT(1))
#define HP_SYSTEM_GMAC0_PAD_BIST_FAIL_INT_ST_M  (HP_SYSTEM_GMAC0_PAD_BIST_FAIL_INT_ST_V << HP_SYSTEM_GMAC0_PAD_BIST_FAIL_INT_ST_S)
#define HP_SYSTEM_GMAC0_PAD_BIST_FAIL_INT_ST_V  0x00000001U
#define HP_SYSTEM_GMAC0_PAD_BIST_FAIL_INT_ST_S  1

/** HP_SYSTEM_GMAC0_PAD_BIST_INT_ENA_REG register
 *  interrupt enable register
 */
#define HP_SYSTEM_GMAC0_PAD_BIST_INT_ENA_REG (DR_REG_HP_SYS_BASE + 0x308)
/** HP_SYSTEM_GMAC0_PAD_BIST_OK_INT_ENA : R/W; bitpos: [0]; default: 0;
 *  Write 1 to enable gmac0 pad bist ok interrupt
 */
#define HP_SYSTEM_GMAC0_PAD_BIST_OK_INT_ENA    (BIT(0))
#define HP_SYSTEM_GMAC0_PAD_BIST_OK_INT_ENA_M  (HP_SYSTEM_GMAC0_PAD_BIST_OK_INT_ENA_V << HP_SYSTEM_GMAC0_PAD_BIST_OK_INT_ENA_S)
#define HP_SYSTEM_GMAC0_PAD_BIST_OK_INT_ENA_V  0x00000001U
#define HP_SYSTEM_GMAC0_PAD_BIST_OK_INT_ENA_S  0
/** HP_SYSTEM_GMAC0_PAD_BIST_FAIL_INT_ENA : R/W; bitpos: [1]; default: 0;
 *  Write 1 to enable gmac0 pad bist fail interrupt
 */
#define HP_SYSTEM_GMAC0_PAD_BIST_FAIL_INT_ENA    (BIT(1))
#define HP_SYSTEM_GMAC0_PAD_BIST_FAIL_INT_ENA_M  (HP_SYSTEM_GMAC0_PAD_BIST_FAIL_INT_ENA_V << HP_SYSTEM_GMAC0_PAD_BIST_FAIL_INT_ENA_S)
#define HP_SYSTEM_GMAC0_PAD_BIST_FAIL_INT_ENA_V  0x00000001U
#define HP_SYSTEM_GMAC0_PAD_BIST_FAIL_INT_ENA_S  1

/** HP_SYSTEM_GMAC0_PAD_BIST_INT_CLR_REG register
 *  interrupt clear register
 */
#define HP_SYSTEM_GMAC0_PAD_BIST_INT_CLR_REG (DR_REG_HP_SYS_BASE + 0x30c)
/** HP_SYSTEM_GMAC0_PAD_BIST_OK_INT_CLR : WT; bitpos: [0]; default: 0;
 *  Write 1 to clr gmac0 pad bist ok interrupt
 */
#define HP_SYSTEM_GMAC0_PAD_BIST_OK_INT_CLR    (BIT(0))
#define HP_SYSTEM_GMAC0_PAD_BIST_OK_INT_CLR_M  (HP_SYSTEM_GMAC0_PAD_BIST_OK_INT_CLR_V << HP_SYSTEM_GMAC0_PAD_BIST_OK_INT_CLR_S)
#define HP_SYSTEM_GMAC0_PAD_BIST_OK_INT_CLR_V  0x00000001U
#define HP_SYSTEM_GMAC0_PAD_BIST_OK_INT_CLR_S  0
/** HP_SYSTEM_GMAC0_PAD_BIST_FAIL_INT_CLR : WT; bitpos: [1]; default: 0;
 *  Write 1 to clr gmac0 pad bist fail interrupt
 */
#define HP_SYSTEM_GMAC0_PAD_BIST_FAIL_INT_CLR    (BIT(1))
#define HP_SYSTEM_GMAC0_PAD_BIST_FAIL_INT_CLR_M  (HP_SYSTEM_GMAC0_PAD_BIST_FAIL_INT_CLR_V << HP_SYSTEM_GMAC0_PAD_BIST_FAIL_INT_CLR_S)
#define HP_SYSTEM_GMAC0_PAD_BIST_FAIL_INT_CLR_V  0x00000001U
#define HP_SYSTEM_GMAC0_PAD_BIST_FAIL_INT_CLR_S  1

/** HP_SYSTEM_GMAC0_PAD_BIST_ST_REG register
 *  gmac0 pad bist status register
 */
#define HP_SYSTEM_GMAC0_PAD_BIST_ST_REG (DR_REG_HP_SYS_BASE + 0x310)
/** HP_SYSTEM_GMAC0_PAD_BIST_RCNT : RO; bitpos: [5:0]; default: 0;
 *  Indicate number of clock cycles received for pad bist debug
 */
#define HP_SYSTEM_GMAC0_PAD_BIST_RCNT    0x0000003FU
#define HP_SYSTEM_GMAC0_PAD_BIST_RCNT_M  (HP_SYSTEM_GMAC0_PAD_BIST_RCNT_V << HP_SYSTEM_GMAC0_PAD_BIST_RCNT_S)
#define HP_SYSTEM_GMAC0_PAD_BIST_RCNT_V  0x0000003FU
#define HP_SYSTEM_GMAC0_PAD_BIST_RCNT_S  0

/** HP_SYSTEM_GMAC1_PAD_BIST_CFG_REG register
 *  gmac1 pad bist control register
 */
#define HP_SYSTEM_GMAC1_PAD_BIST_CFG_REG (DR_REG_HP_SYS_BASE + 0x314)
/** HP_SYSTEM_GMAC1_PAD_BIST_START : WT; bitpos: [0]; default: 0;
 *  Write 1 to start gmac1 pad bist
 */
#define HP_SYSTEM_GMAC1_PAD_BIST_START    (BIT(0))
#define HP_SYSTEM_GMAC1_PAD_BIST_START_M  (HP_SYSTEM_GMAC1_PAD_BIST_START_V << HP_SYSTEM_GMAC1_PAD_BIST_START_S)
#define HP_SYSTEM_GMAC1_PAD_BIST_START_V  0x00000001U
#define HP_SYSTEM_GMAC1_PAD_BIST_START_S  0

