espressif/esp-idf/components/soc/esp32s31/register/soc/hp_system_reg.h
/** HP_SYSTEM_GMAC1_PAD_BIST_INT_RAW_REG register
 *  gmac1 pad bist interrupt raw register
 */
#define HP_SYSTEM_GMAC1_PAD_BIST_INT_RAW_REG (DR_REG_HP_SYS_BASE + 0x318)
/** HP_SYSTEM_GMAC1_PAD_BIST_OK_INT_RAW : R/WTC/SS; bitpos: [0]; default: 0;
 *  intr triggered when bist finish and status is bist ok
 */
#define HP_SYSTEM_GMAC1_PAD_BIST_OK_INT_RAW    (BIT(0))
#define HP_SYSTEM_GMAC1_PAD_BIST_OK_INT_RAW_M  (HP_SYSTEM_GMAC1_PAD_BIST_OK_INT_RAW_V << HP_SYSTEM_GMAC1_PAD_BIST_OK_INT_RAW_S)
#define HP_SYSTEM_GMAC1_PAD_BIST_OK_INT_RAW_V  0x00000001U
#define HP_SYSTEM_GMAC1_PAD_BIST_OK_INT_RAW_S  0
/** HP_SYSTEM_GMAC1_PAD_BIST_FAIL_INT_RAW : R/WTC/SS; bitpos: [1]; default: 0;
 *  intr triggered when bist finish and status is bist fail
 */
#define HP_SYSTEM_GMAC1_PAD_BIST_FAIL_INT_RAW    (BIT(1))
#define HP_SYSTEM_GMAC1_PAD_BIST_FAIL_INT_RAW_M  (HP_SYSTEM_GMAC1_PAD_BIST_FAIL_INT_RAW_V << HP_SYSTEM_GMAC1_PAD_BIST_FAIL_INT_RAW_S)
#define HP_SYSTEM_GMAC1_PAD_BIST_FAIL_INT_RAW_V  0x00000001U
#define HP_SYSTEM_GMAC1_PAD_BIST_FAIL_INT_RAW_S  1

/** HP_SYSTEM_GMAC1_PAD_BIST_INT_ST_REG register
 *  masked interrupt register
 */
#define HP_SYSTEM_GMAC1_PAD_BIST_INT_ST_REG (DR_REG_HP_SYS_BASE + 0x31c)
/** HP_SYSTEM_GMAC1_PAD_BIST_OK_INT_ST : RO; bitpos: [0]; default: 0;
 *  the masked interrupt status of gmac1 pad bist ok interrupt
 */
#define HP_SYSTEM_GMAC1_PAD_BIST_OK_INT_ST    (BIT(0))
#define HP_SYSTEM_GMAC1_PAD_BIST_OK_INT_ST_M  (HP_SYSTEM_GMAC1_PAD_BIST_OK_INT_ST_V << HP_SYSTEM_GMAC1_PAD_BIST_OK_INT_ST_S)
#define HP_SYSTEM_GMAC1_PAD_BIST_OK_INT_ST_V  0x00000001U
#define HP_SYSTEM_GMAC1_PAD_BIST_OK_INT_ST_S  0
/** HP_SYSTEM_GMAC1_PAD_BIST_FAIL_INT_ST : RO; bitpos: [1]; default: 0;
 *  the masked interrupt status of gmac1 pad bist fail interrupt
 */
#define HP_SYSTEM_GMAC1_PAD_BIST_FAIL_INT_ST    (BIT(1))
#define HP_SYSTEM_GMAC1_PAD_BIST_FAIL_INT_ST_M  (HP_SYSTEM_GMAC1_PAD_BIST_FAIL_INT_ST_V << HP_SYSTEM_GMAC1_PAD_BIST_FAIL_INT_ST_S)
#define HP_SYSTEM_GMAC1_PAD_BIST_FAIL_INT_ST_V  0x00000001U
#define HP_SYSTEM_GMAC1_PAD_BIST_FAIL_INT_ST_S  1

/** HP_SYSTEM_GMAC1_PAD_BIST_INT_ENA_REG register
 *  interrupt enable register
 */
#define HP_SYSTEM_GMAC1_PAD_BIST_INT_ENA_REG (DR_REG_HP_SYS_BASE + 0x320)
/** HP_SYSTEM_GMAC1_PAD_BIST_OK_INT_ENA : R/W; bitpos: [0]; default: 0;
 *  Write 1 to enable gmac1 pad bist ok interrupt
 */
#define HP_SYSTEM_GMAC1_PAD_BIST_OK_INT_ENA    (BIT(0))
#define HP_SYSTEM_GMAC1_PAD_BIST_OK_INT_ENA_M  (HP_SYSTEM_GMAC1_PAD_BIST_OK_INT_ENA_V << HP_SYSTEM_GMAC1_PAD_BIST_OK_INT_ENA_S)
#define HP_SYSTEM_GMAC1_PAD_BIST_OK_INT_ENA_V  0x00000001U
#define HP_SYSTEM_GMAC1_PAD_BIST_OK_INT_ENA_S  0
/** HP_SYSTEM_GMAC1_PAD_BIST_FAIL_INT_ENA : R/W; bitpos: [1]; default: 0;
 *  Write 1 to enable gmac1 pad bist fail interrupt
 */
#define HP_SYSTEM_GMAC1_PAD_BIST_FAIL_INT_ENA    (BIT(1))
#define HP_SYSTEM_GMAC1_PAD_BIST_FAIL_INT_ENA_M  (HP_SYSTEM_GMAC1_PAD_BIST_FAIL_INT_ENA_V << HP_SYSTEM_GMAC1_PAD_BIST_FAIL_INT_ENA_S)
#define HP_SYSTEM_GMAC1_PAD_BIST_FAIL_INT_ENA_V  0x00000001U
#define HP_SYSTEM_GMAC1_PAD_BIST_FAIL_INT_ENA_S  1

/** HP_SYSTEM_GMAC1_PAD_BIST_INT_CLR_REG register
 *  interrupt clear register
 */
#define HP_SYSTEM_GMAC1_PAD_BIST_INT_CLR_REG (DR_REG_HP_SYS_BASE + 0x324)
/** HP_SYSTEM_GMAC1_PAD_BIST_OK_INT_CLR : WT; bitpos: [0]; default: 0;
 *  Write 1 to clr gmac1 pad bist ok interrupt
 */
#define HP_SYSTEM_GMAC1_PAD_BIST_OK_INT_CLR    (BIT(0))
#define HP_SYSTEM_GMAC1_PAD_BIST_OK_INT_CLR_M  (HP_SYSTEM_GMAC1_PAD_BIST_OK_INT_CLR_V << HP_SYSTEM_GMAC1_PAD_BIST_OK_INT_CLR_S)
#define HP_SYSTEM_GMAC1_PAD_BIST_OK_INT_CLR_V  0x00000001U
#define HP_SYSTEM_GMAC1_PAD_BIST_OK_INT_CLR_S  0
/** HP_SYSTEM_GMAC1_PAD_BIST_FAIL_INT_CLR : WT; bitpos: [1]; default: 0;
 *  Write 1 to clr gmac1 pad bist fail interrupt
 */
#define HP_SYSTEM_GMAC1_PAD_BIST_FAIL_INT_CLR    (BIT(1))
#define HP_SYSTEM_GMAC1_PAD_BIST_FAIL_INT_CLR_M  (HP_SYSTEM_GMAC1_PAD_BIST_FAIL_INT_CLR_V << HP_SYSTEM_GMAC1_PAD_BIST_FAIL_INT_CLR_S)
#define HP_SYSTEM_GMAC1_PAD_BIST_FAIL_INT_CLR_V  0x00000001U
#define HP_SYSTEM_GMAC1_PAD_BIST_FAIL_INT_CLR_S  1

/** HP_SYSTEM_GMAC1_PAD_BIST_ST_REG register
 *  gmac1 pad bist status register
 */
#define HP_SYSTEM_GMAC1_PAD_BIST_ST_REG (DR_REG_HP_SYS_BASE + 0x328)
/** HP_SYSTEM_GMAC1_PAD_BIST_RCNT : RO; bitpos: [5:0]; default: 0;
 *  Indicate number of clock cycles received for pad bist debug
 */
#define HP_SYSTEM_GMAC1_PAD_BIST_RCNT    0x0000003FU
#define HP_SYSTEM_GMAC1_PAD_BIST_RCNT_M  (HP_SYSTEM_GMAC1_PAD_BIST_RCNT_V << HP_SYSTEM_GMAC1_PAD_BIST_RCNT_S)
#define HP_SYSTEM_GMAC1_PAD_BIST_RCNT_V  0x0000003FU
#define HP_SYSTEM_GMAC1_PAD_BIST_RCNT_S  0

/** HP_SYSTEM_CPU_PWAIT_MODE_REG register
 *  Indicate status of core0 and core1 pwait
 */
#define HP_SYSTEM_CPU_PWAIT_MODE_REG (DR_REG_HP_SYS_BASE + 0x338)
/** HP_SYSTEM_CPU_PWAIT_MODE : RO; bitpos: [1:0]; default: 0;
 *  Indicate status of core0 and core1 pwait
 */
#define HP_SYSTEM_CPU_PWAIT_MODE    0x00000003U
#define HP_SYSTEM_CPU_PWAIT_MODE_M  (HP_SYSTEM_CPU_PWAIT_MODE_V << HP_SYSTEM_CPU_PWAIT_MODE_S)
#define HP_SYSTEM_CPU_PWAIT_MODE_V  0x00000003U
#define HP_SYSTEM_CPU_PWAIT_MODE_S  0

#ifdef __cplusplus
}
#endif
